import { Label, ProjectsDetails } from "@/interfaces/projects"
export const LABELS_BLOCK: Label[] = [
  { label: "סטטוס:" },
  { label: "משך הפרויקט:" },
  { label: "שנת פרויקט:" },
]
export const LABELS: Label[] = [
  { label: "פתרון גג:" },
  { label: "פתרון:" },
  { label: "ספק:" },
  { label: "רשות מקומית: " },
]
export const PROJECTS_DATA: Record<string, ProjectsDetails> = {
  "public-engagement": {
    id: "public-engagement",
    filterKey: "management",
    name: "Public-Engagement",
    headerTitle:
      "מערכת לקיום הליכי שיתוף ציבור בכלל נושאי העיסוק של הרשות המקומית",
    headerLinks: [
      { title: "מערכות לשיתוף ציבור", redirectTo: "/" },
      { title: "Raizit", redirectTo: "/" },
      { title: "Raizit", redirectTo: "/" },
      { title: "גני תקווה", redirectTo: "/" },
    ],
    linksBlock: [{ label: "פעיל" }, { label: "חודש וחצי" }, { label: "2021" }],
    mainArticles: [
      {
        description:
          "מועצה מקומית גני תקווה זיהתה את חשיבות שיתוף תושבים בעיצוב חייהם וקבלת החלטה. לאור הבנה זו, לקיום הליכי שיתוף ציבור משמעותיים ואיכותיים. על-מנת לקדם את שיתוף הציבור, הרשות המקומית מפעילה תשתית דיגיטלית, שבמסגרתה ניתן ליצור מגוון חווייתיות ותהליכים בנושאי אסטרטגיה, תכנון עירוני, תרבות, בריאות, כלכלה מקומית ובכל נושא אחר בו הרשות המקומית עוסקת.",
      },
      {
        description:
          "התהליכים הם רב שלביים ומלווים את הפרויקט משלב חשיפת הנושא באופן ויזואלי ועד הצגת תוצאות וישום התובנות שעלו מהליך שיתוף הציבור. כל התהליכים נשמרים במערכת וניתנים לצפייה על-ידי התושבים ובעלי העניין בכל זמן נתון. כמו כן, המערכת יוצרת פילוח על-פי תחומי עניין עבור התושב ומציעה לו להשתתף בתהליכים שעשויים לעניין אותו על-פי המידע הקיים עליו במרחב האישי.",
      },
      {
        description:
          "יישום נוסף הוא שימוש בשכבת מידע גיאוגרפי – התושבים יכולים לראות תהליכי שיתוף ציבור שעשיינו אותם מבחינת הקרבה הגיאוגרפית. הרשות המקומית בעלת גמישות מוחלטת בשימוש במערכת: צורך ואופן הליך שיתוף הציבור, סוג השאלות, הבחירה בין תצוגות, מיקום גיאוגרפי ועוד.",
      },
      {
        description:
          'תהליך שיתוף הציבור הראשון שקידמה המועצה המקומית גני תקווה עסק בסוגיה האסטרטגית של מעבר מטשטוש של מועצה מאות תושבים לתהליך פניות תושבים בהיקף נרחב – תהליך שיתוף הציבור השני עסק בהקמת אזור המאפשר התעסוקה מגוונת תוך התמקדות בתעסוקה הממוקדת ביותר, על-מנת לספק פתרון ביניים בין עבודה מרחוק לעבודה פיזית למרחקים של עשרות ק"מ.',
      },
    ],
    suitable: "כולן.",
    recommendations:
      'המערכת ידידותית למשתמש וניתן להפעילה גם ע"י איש צוות אחראי יחיד. ניתן ואף מומלץ להגדיר בחלקן מן התהליכים שתהיה אחראי על תפקיד ויעלו רק באישור. כן, מומלץ להגדיר בעל תפקיד שיהיה אחראי על הסוגיה הנבחנת, למשל: אגף הדוברות, קשרי קהילה וכו. בנוסף, מומלץ לקיים תהליך הקמה משמעותי עם החברה בשלב אפיון הצרכים והמערכת. החברה מספקת את הייעוץ הנדרש וכדאי להעמיק בשלב זה. מומלץ לבחון האם בעיסוק בשאלות וסוגיות אסטרטגיות ורגישות, כדאי להסתייע בייעוץ חיצוני ובאגף הדוברות של הרשות המקומית.',
    contacts: {
      title: "רשות מקומית",
      name: "נהומי חי",
      role: "מנהל אגף קשרי קהילה, דוברות והסברה",
      email: "nahumi@gantik.org.il",
    },
    providerBlock: {
      title: "Raizit",
      iconSrc: "/images/webp/projects/provider/raizit.png",
      articles: [
        {
          title: "שימושים ברשויות מקומיות",
          description:
            " תל אביב-יפו, מועצה מקומית גני תקווה, ארגון הג'וינט למגזר החרדי בשיתוף עם רשויות מקומיות בנגב, ועוד",
        },
        {
          title: "לקוחות נוספים",
          description: "עמותת דרכנו, עמותת שיתופים ועוד",
        },
        { title: "איש קשר", description: ' ערן עיציון, מנכ"ל | 050-6205284' },
        { title: " שנת הקמה", description: "2021" },
      ],
      emails: [{ title: "eran@raizit.com" }, { title: "www.raizit.com" }],
    },
    constactBlock: {
      title: "מעוניין לבצע את הפרויקט הזה באזורך?",
      contactButtons: [
        { title: "פתיחת פרויקט", variant: "primary", redirectTo: "/" },
        {
          title: "עבור לרשימת הכלים ⬅",
          variant: "gradient",
          redirectTo: "/",
          isGradient: true,
        },
      ],
    },
    slider: [
      { imageSrc: "/images/webp/projects/slider/slide-1.png" },
      { imageSrc: "/images/webp/projects/slider/slide-1.png" },
      { imageSrc: "/images/webp/projects/slider/slide-1.png" },
      { imageSrc: "/images/webp/projects/slider/slide-1.png" },
    ],
  },
  "workplan-task-management": {
    id: "workplan-task-management",
    filterKey: "public",
    name: "Workplan task management",
    headerTitle: "מערכת לניהול משימות מתוך תכנית עבודה",
    headerLinks: [
      { title: "מערכות לשיתוף ציבור", redirectTo: "/" },
      { title: "topsolutions", redirectTo: "/" },
      { title: "Action Base", redirectTo: "/" },
      { title: "גני תקווה", redirectTo: "/" },
    ],
    linksBlock: [{ label: "פעיל" }, { label: "חודש וחצי" }, { label: "2019" }],
    mainArticles: [
      {
        description:
          "מועצה מקומית גני תקווה זיהתה את חשיבות שיתוף תושבים בעיצוב חייהם וקבלת החלטה. לאור הבנה זו, לקיום הליכי שיתוף ציבור משמעותיים ואיכותיים. על-מנת לקדם את שיתוף הציבור, הרשות המקומית מפעילה תשתית דיגיטלית, שבמסגרתה ניתן ליצור מגוון חווייתיות ותהליכים בנושאי אסטרטגיה, תכנון עירוני, תרבות, בריאות, כלכלה מקומית ובכל נושא אחר בו הרשות המקומית עוסקת.",
      },
      {
        description:
          "התהליכים הם רב שלביים ומלווים את הפרויקט משלב חשיפת הנושא באופן ויזואלי ועד הצגת תוצאות וישום התובנות שעלו מהליך שיתוף הציבור. כל התהליכים נשמרים במערכת וניתנים לצפייה על-ידי התושבים ובעלי העניין בכל זמן נתון. כמו כן, המערכת יוצרת פילוח על-פי תחומי עניין עבור התושב ומציעה לו להשתתף בתהליכים שעשויים לעניין אותו על-פי המידע הקיים עליו במרחב האישי.",
      },
      {
        description:
          "יישום נוסף הוא שימוש בשכבת מידע גיאוגרפי – התושבים יכולים לראות תהליכי שיתוף ציבור שעשיינו אותם מבחינת הקרבה הגיאוגרפית. הרשות המקומית בעלת גמישות מוחלטת בשימוש במערכת: צורך ואופן הליך שיתוף הציבור, סוג השאלות, הבחירה בין תצוגות, מיקום גיאוגרפי ועוד.",
      },
      {
        description:
          'תהליך שיתוף הציבור הראשון שקידמה המועצה המקומית גני תקווה עסק בסוגיה האסטרטגית של מעבר מטשטוש של מועצה מאות תושבים לתהליך פניות תושבים בהיקף נרחב – תהליך שיתוף הציבור השני עסק בהקמת אזור המאפשר התעסוקה מגוונת תוך התמקדות בתעסוקה הממוקדת ביותר, על-מנת לספק פתרון ביניים בין עבודה מרחוק לעבודה פיזית למרחקים של עשרות ק"מ.',
      },
    ],
    suitable: "כולן.",
    recommendations:
      'המערכת ידידותית למשתמש וניתן להפעילה גם ע"י איש צוות אחראי יחיד. ניתן ואף מומלץ להגדיר בחלקן מן התהליכים שתהיה אחראי על תפקיד ויעלו רק באישור. כן, מומלץ להגדיר בעל תפקיד שיהיה אחראי על הסוגיה הנבחנת, למשל: אגף הדוברות, קשרי קהילה וכו. בנוסף, מומלץ לקיים תהליך הקמה משמעותי עם החברה בשלב אפיון הצרכים והמערכת. החברה מספקת את הייעוץ הנדרש וכדאי להעמיק בשלב זה. מומלץ לבחון האם בעיסוק בשאלות וסוגיות אסטרטגיות ורגישות, כדאי להסתייע בייעוץ חיצוני ובאגף הדוברות של הרשות המקומית.',
    contacts: {
      title: "רשות מקומית",
      name: "נהומי חי",
      role: "מנהל אגף קשרי קהילה, דוברות והסברה",
      email: "nahumi@gantik.org.il",
    },
    providerBlock: {
      title: "topsolutions",
      iconSrc: "/images/webp/projects/provider/topsolutions.png",
      articles: [
        {
          title: "שימושים ברשויות מקומיות",
          description:
            " תל אביב-יפו, מועצה מקומית גני תקווה, ארגון הג'וינט למגזר החרדי בשיתוף עם רשויות מקומיות בנגב, ועוד",
        },
        {
          title: "לקוחות נוספים",
          description: "עמותת דרכנו, עמותת שיתופים ועוד",
        },
        { title: "איש קשר", description: ' ערן עיציון, מנכ"ל | 050-6205284' },
        { title: " שנת הקמה", description: "2021" },
      ],
      emails: [{ title: "eran@raizit.com" }, { title: "www.raizit.com" }],
    },
    constactBlock: {
      title: "מעוניין לבצע את הפרויקט הזה באזורך?",
      contactButtons: [
        { title: "פתיחת פרויקט", variant: "primary", redirectTo: "/" },
        {
          title: "עבור לרשימת הכלים ⬅",
          variant: "gradient",
          redirectTo: "/",
          isGradient: true,
        },
      ],
    },
    slider: [
      { imageSrc: "/images/webp/projects/slider/slide-2.png" },
      { imageSrc: "/images/webp/projects/slider/slide-1.png" },
      { imageSrc: "/images/webp/projects/slider/slide-1.png" },
      { imageSrc: "/images/webp/projects/slider/slide-1.png" },
    ],
  },
  "contractor-tracking": {
    id: "contractor-tracking",
    filterKey: "public",
    name: "Workplan task management",
    headerTitle: "מערכת לניהול משימות מתוך תכנית עבודה",
    headerLinks: [
      { title: "מערכות לשיתוף ציבור", redirectTo: "/" },
      { title: "Eye Do", redirectTo: "/" },
      { title: "Eye Do", redirectTo: "/" },
      { title: "גני תקווה", redirectTo: "/" },
    ],
    linksBlock: [{ label: "פעיל" }, { label: "חודש וחצי" }, { label: "2019" }],
    mainArticles: [
      {
        description:
          "מועצה מקומית גני תקווה זיהתה את חשיבות שיתוף תושבים בעיצוב חייהם וקבלת החלטה. לאור הבנה זו, לקיום הליכי שיתוף ציבור משמעותיים ואיכותיים. על-מנת לקדם את שיתוף הציבור, הרשות המקומית מפעילה תשתית דיגיטלית, שבמסגרתה ניתן ליצור מגוון חווייתיות ותהליכים בנושאי אסטרטגיה, תכנון עירוני, תרבות, בריאות, כלכלה מקומית ובכל נושא אחר בו הרשות המקומית עוסקת.",
      },
      {
        description:
          "התהליכים הם רב שלביים ומלווים את הפרויקט משלב חשיפת הנושא באופן ויזואלי ועד הצגת תוצאות וישום התובנות שעלו מהליך שיתוף הציבור. כל התהליכים נשמרים במערכת וניתנים לצפייה על-ידי התושבים ובעלי העניין בכל זמן נתון. כמו כן, המערכת יוצרת פילוח על-פי תחומי עניין עבור התושב ומציעה לו להשתתף בתהליכים שעשויים לעניין אותו על-פי המידע הקיים עליו במרחב האישי.",
      },
      {
        description:
          "יישום נוסף הוא שימוש בשכבת מידע גיאוגרפי – התושבים יכולים לראות תהליכי שיתוף ציבור שעשיינו אותם מבחינת הקרבה הגיאוגרפית. הרשות המקומית בעלת גמישות מוחלטת בשימוש במערכת: צורך ואופן הליך שיתוף הציבור, סוג השאלות, הבחירה בין תצוגות, מיקום גיאוגרפי ועוד.",
      },
      {
        description:
          'תהליך שיתוף הציבור הראשון שקידמה המועצה המקומית גני תקווה עסק בסוגיה האסטרטגית של מעבר מטשטוש של מועצה מאות תושבים לתהליך פניות תושבים בהיקף נרחב – תהליך שיתוף הציבור השני עסק בהקמת אזור המאפשר התעסוקה מגוונת תוך התמקדות בתעסוקה הממוקדת ביותר, על-מנת לספק פתרון ביניים בין עבודה מרחוק לעבודה פיזית למרחקים של עשרות ק"מ.',
      },
    ],
    suitable: "כולן.",
    recommendations:
      'המערכת ידידותית למשתמש וניתן להפעילה גם ע"י איש צוות אחראי יחיד. ניתן ואף מומלץ להגדיר בחלקן מן התהליכים שתהיה אחראי על תפקיד ויעלו רק באישור. כן, מומלץ להגדיר בעל תפקיד שיהיה אחראי על הסוגיה הנבחנת, למשל: אגף הדוברות, קשרי קהילה וכו. בנוסף, מומלץ לקיים תהליך הקמה משמעותי עם החברה בשלב אפיון הצרכים והמערכת. החברה מספקת את הייעוץ הנדרש וכדאי להעמיק בשלב זה. מומלץ לבחון האם בעיסוק בשאלות וסוגיות אסטרטגיות ורגישות, כדאי להסתייע בייעוץ חיצוני ובאגף הדוברות של הרשות המקומית.',
    contacts: {
      title: "רשות מקומית",
      name: "נהומי חי",
      role: "מנהל אגף קשרי קהילה, דוברות והסברה",
      email: "nahumi@gantik.org.il",
    },
    providerBlock: {
      title: "topsolutions",
      iconSrc: "/images/webp/projects/provider/topsolutions.png",
      articles: [
        {
          title: "שימושים ברשויות מקומיות",
          description:
            " תל אביב-יפו, מועצה מקומית גני תקווה, ארגון הג'וינט למגזר החרדי בשיתוף עם רשויות מקומיות בנגב, ועוד",
        },
        {
          title: "לקוחות נוספים",
          description: "עמותת דרכנו, עמותת שיתופים ועוד",
        },
        { title: "איש קשר", description: ' ערן עיציון, מנכ"ל | 050-6205284' },
        { title: " שנת הקמה", description: "2021" },
      ],
      emails: [{ title: "eran@raizit.com" }, { title: "www.raizit.com" }],
    },
    constactBlock: {
      title: "מעוניין לבצע את הפרויקט הזה באזורך?",
      contactButtons: [
        { title: "פתיחת פרויקט", variant: "primary", redirectTo: "/" },
        {
          title: "עבור לרשימת הכלים ⬅",
          variant: "gradient",
          redirectTo: "/",
          isGradient: true,
        },
      ],
    },
    slider: [
      { imageSrc: "/images/webp/projects/slider/slide-3.png" },
      { imageSrc: "/images/webp/projects/slider/slide-1.png" },
      { imageSrc: "/images/webp/projects/slider/slide-2.png" },
      { imageSrc: "/images/webp/projects/slider/slide-1.png" },
    ],
  },
}
export interface AdditionalProject {
  title: string
  button: string
  isAdditional?: boolean
}
export const ADDITIONAL_PROJECTS: AdditionalProject[] = [
  {
    title: "פרויקטים התואמים לפרופיל שלך",
    button: "לכל הפרויקטים",
  },
  {
    title: "פרויקטים נוספים שאולי תתעניין בהם",
    button: "לכל הפרויקטים",
    isAdditional: true,
  },
]
