// import { Label, ProjectsDetails } from "@/interfaces/projects"
// import { ContactButton } from "@/interfaces/tools"
// export const PROJECT_TAGS: Label[] = [
//   { label: "פתרון גג:" },
//   { label: "פתרון:" },
//   { label: "ספק:" },
//   { label: "רשות מקומית: " },
// ]
// export const PROJECT_STATUS: Label[] = [
//   { label: "סטטוס:" },
//   { label: "משך הפרויקט:" },
//   { label: "שנת פרויקט:" },
// ]
// export const CONTACT_BUTTONS: ContactButton[] = [
//   { title: "פתיחת פרויקט", variant: "primary", redirectTo: "/" },
//   {
//     title: "עבור לרשימת הכלים ",
//     variant: "gradient",
//     redirectTo: "/",
//     isGradient: true,
//   },
// ]
// export const PROJECTS_DATA: Record<string, ProjectsDetails> = {
//   "public-engagement": {
//     id: "public-engagement",
//     filterKey: "management",
//     name: "Public-Engagement",
//     headerTitle:
//       "מערכת לקיום הליכי שיתוף ציבור בכלל נושאי העיסוק של הרשות המקומית",
//     tags: [
//       { title: "מערכות לשיתוף ציבור" },
//       { title: "Raizit" },
//       { title: "Raizit" },
//       { title: "גני תקווה" },
//     ],
//     statuses: [{ label: "פעיל" }, { label: "חודש וחצי" }, { label: "2021" }],
//     mainArticles: [
//       {
//         description:
//           "מועצה מקומית גני תקווה זיהתה את חשיבות שיתוף תושבים בעיצוב חייהם וקבלת החלטה. לאור הבנה זו, לקיום הליכי שיתוף ציבור משמעותיים ואיכותיים. על-מנת לקדם את שיתוף הציבור, הרשות המקומית מפעילה תשתית דיגיטלית, שבמסגרתה ניתן ליצור מגוון חווייתיות ותהליכים בנושאי אסטרטגיה, תכנון עירוני, תרבות, בריאות, כלכלה מקומית ובכל נושא אחר בו הרשות המקומית עוסקת.",
//       },
//       {
//         description:
//           "התהליכים הם רב שלביים ומלווים את הפרויקט משלב חשיפת הנושא באופן ויזואלי ועד הצגת תוצאות וישום התובנות שעלו מהליך שיתוף הציבור. כל התהליכים נשמרים במערכת וניתנים לצפייה על-ידי התושבים ובעלי העניין בכל זמן נתון. כמו כן, המערכת יוצרת פילוח על-פי תחומי עניין עבור התושב ומציעה לו להשתתף בתהליכים שעשויים לעניין אותו על-פי המידע הקיים עליו במרחב האישי.",
//       },
//       {
//         description:
//           "יישום נוסף הוא שימוש בשכבת מידע גיאוגרפי – התושבים יכולים לראות תהליכי שיתוף ציבור שעשיינו אותם מבחינת הקרבה הגיאוגרפית. הרשות המקומית בעלת גמישות מוחלטת בשימוש במערכת: צורך ואופן הליך שיתוף הציבור, סוג השאלות, הבחירה בין תצוגות, מיקום גיאוגרפי ועוד.",
//       },
//       {
//         description:
//           'תהליך שיתוף הציבור הראשון שקידמה המועצה המקומית גני תקווה עסק בסוגיה האסטרטגית של מעבר מטשטוש של מועצה מאות תושבים לתהליך פניות תושבים בהיקף נרחב – תהליך שיתוף הציבור השני עסק בהקמת אזור המאפשר התעסוקה מגוונת תוך התמקדות בתעסוקה הממוקדת ביותר, על-מנת לספק פתרון ביניים בין עבודה מרחוק לעבודה פיזית למרחקים של עשרות ק"מ.',
//       },
//     ],
//     suitable: "כולן.",
//     recommendations:
//       'המערכת ידידותית למשתמש וניתן להפעילה גם ע"י איש צוות אחראי יחיד. ניתן ואף מומלץ להגדיר בחלקן מן התהליכים שתהיה אחראי על תפקיד ויעלו רק באישור. כן, מומלץ להגדיר בעל תפקיד שיהיה אחראי על הסוגיה הנבחנת, למשל: אגף הדוברות, קשרי קהילה וכו. בנוסף, מומלץ לקיים תהליך הקמה משמעותי עם החברה בשלב אפיון הצרכים והמערכת. החברה מספקת את הייעוץ הנדרש וכדאי להעמיק בשלב זה. מומלץ לבחון האם בעיסוק בשאלות וסוגיות אסטרטגיות ורגישות, כדאי להסתייע בייעוץ חיצוני ובאגף הדוברות של הרשות המקומית.',
//     contacts: {
//       title: "רשות מקומית",
//       name: "נהומי חי",
//       role: "מנהל אגף קשרי קהילה, דוברות והסברה",
//       email: "nahumi@gantik.org.il",
//     },
//     providerBlock: {
//       title: "Raizit",
//       iconSrc: "/images/webp/projects/provider/raizit.png",
//       articles: [
//         {
//           title: "שימושים ברשויות מקומיות",
//           description:
//             " תל אביב-יפו, מועצה מקומית גני תקווה, ארגון הג'וינט למגזר החרדי בשיתוף עם רשויות מקומיות בנגב, ועוד",
//         },
//         {
//           title: "לקוחות נוספים",
//           description: "עמותת דרכנו, עמותת שיתופים ועוד",
//         },
//         { title: "איש קשר", description: ' ערן עיציון, מנכ"ל | 050-6205284' },
//         { title: " שנת הקמה", description: "2021" },
//       ],
//       emails: [{ title: "eran@raizit.com" }, { title: "www.raizit.com" }],
//     },
//     contactBlock: {
//       title: "מעוניין לבצע את הפרויקט הזה באזורך?",
//     },
//     slider: [
//       { imageSrc: "/images/webp/projects/slider/public-eng-1.png" },
//       { imageSrc: "/images/webp/projects/slider/public-eng-1.png" },
//     ],
//   },
//   "contractor-tracking": {
//     id: "contractor-tracking",
//     filterKey: "public",
//     name: "Workplan task management",
//     headerTitle: "מערכת לניהול משימות מתוך תכנית עבודה",
//     tags: [
//       { title: "מערכות לשיתוף ציבור" },
//       { title: "Eye Do" },
//       { title: "Eye Do" },
//       { title: "גני תקווה" },
//     ],
//     statuses: [{ label: "פעיל" }, { label: "חודש וחצי" }, { label: "2019" }],
//     mainArticles: [
//       {
//         description:
//           'לאגף שפ"ע יש המון תחומי אחריות וספר רב של קבלנים מצד אחד ומצד שני חוסר בקרה / תקנים. הנהיית ראש המועצה והמנכ"ל הייתה מקסימום פיקוח והתראה על הקבלנים השונים במינימום השקעה / כ"א, וזאת תוך הצגת עבודה איכותית וכשירה משפטית.',
//       },
//       {
//         description:
//           'מתוך כך, אופיינה המערכת בעזרת חברת "איידן", ופועלת מול כל מכרזי הקבלנים: גינון, חשמל, ניקיון, חישוב , ניקיון מוס"ח ובניי מתחנמות, אשפה וגזם (טלפלקציות וקבלנים). האפליקציה ניהול אשר נמצאת אצל פקח המועצה בשטח. תהליך עבודה: פקח רואה חריגה, הוא פותח את האפליקציה, בוחר בסוג החריגה, תיאור המקרה ותמונה. שעה, תאריך ומיקום נכנסים באופן אוטומטי כולל ציון GPS. בעקבות ההזנה, נשלח מייל אוטומטי לקבלן והעתק למנהל האגף, הקבלן, בזמן אמת חותם על הקנס, טופס זה קביל בבית המשפט ואין לקבלן אחר כך אפשרות להלין עליו.',
//       },
//       {
//         description:
//           "במידה והקבלן מבקש את הלקוח בידיי, שמורה לו הזכות להגיש ערעור ולבטל את הקנס. ההודעה היא למעשה דף פתיחה של הרשות המקומית בצירוף מיקום החריגה, תמונה, סוג חריגה וגובה הקנס אשר מחושב אוטומטית מאפייני החוזה מול הקבלן. כל הקנסות מרוכזים אצל מנהל האגף וכך הוא יכול לשלוף דוח חודשי, או לבדוק אחורה בזמן מגמת שיפור / נקודות לשיפור וכו'...המטרה בסופו של דבר היא להביא את הקבלנים לבצע את העבודה ולא לקנוס אותם, הקנסות הם כלי אחרון ואפקטיבי מאוד לשיפור איכות השירות והביצוע.",
//       },
//       {
//         description:
//           'מערכת חישובים באגף שפ"ע בלבד. אולם אגף שפ"ע מעצב ערך מורחב וכולל מלבד לתחומי האחריות הקלאסיים של אגף שפ"ע: אחזקת מבני ציבור, אחזקת חשמל תאורת רחובות, בניין שיפוצים, אחזקת כבישים ומדרכות, אחזקת מתקני משחק וספסלים, פיקוח עירוני, וטרינריה, אחזקת מוסדות חינוך, איכות הסביבה, תחבורה, פרוייקטים, תנועה ומחזור.',
//       },
//       {
//         description:
//           "המחלך נעשה כהליכה מרהיבה רחבה של ראש המועצה אל עבר דיגיטל ורובו אלד חדשות בכל תחומי העשייה והנהגה בין היתר למקסימום דיגיטציה בעבודת הרשות.",
//       },
//     ],
//     suitable: "כולן.",
//     recommendations:
//       'המערכת ידידותית למשתמש וניתן להפעילה גם ע"י איש צוות אחראי יחיד. ניתן ואף מומלץ להגדיר בחלקן מן התהליכים שתהיה אחראי על תפקיד ויעלו רק באישור. כן, מומלץ להגדיר בעל תפקיד שיהיה אחראי על הסוגיה הנבחנת, למשל: אגף הדוברות, קשרי קהילה וכו. בנוסף, מומלץ לקיים תהליך הקמה משמעותי עם החברה בשלב אפיון הצרכים והמערכת. החברה מספקת את הייעוץ הנדרש וכדאי להעמיק בשלב זה. מומלץ לבחון האם בעיסוק בשאלות וסוגיות אסטרטגיות ורגישות, כדאי להסתייע בייעוץ חיצוני ובאגף הדוברות של הרשות המקומית.',
//     contacts: {
//       title: "רשות מקומית",
//       name: "נהומי חי",
//       role: "מנהל אגף קשרי קהילה, דוברות והסברה",
//       email: "nahumi@gantik.org.il",
//     },
//     providerBlock: {
//       title: "topsolutions",
//       iconSrc: "/images/webp/projects/provider/topsolutions.png",
//       articles: [
//         {
//           title: "שימושים ברשויות מקומיות",
//           description:
//             " תל אביב-יפו, מועצה מקומית גני תקווה, ארגון הג'וינט למגזר החרדי בשיתוף עם רשויות מקומיות בנגב, ועוד",
//         },
//         {
//           title: "לקוחות נוספים",
//           description: "עמותת דרכנו, עמותת שיתופים ועוד",
//         },
//         { title: "איש קשר", description: ' ערן עיציון, מנכ"ל | 050-6205284' },
//         { title: " שנת הקמה", description: "2021" },
//       ],
//       emails: [{ title: "eran@raizit.com" }, { title: "www.raizit.com" }],
//     },
//     contactBlock: {
//       title: "מעוניין לבצע את הפרויקט הזה באזורך?",
//     },
//     slider: [
//       { imageSrc: "/images/webp/projects/slider/contr-tracking-1.png" },
//       { imageSrc: "/images/webp/projects/slider/contr-tracking-1.png" },
//       { imageSrc: "/images/webp/projects/slider/community-1.png" },
//     ],
//   },
//   "task-budget-management": {
//     id: "task-budget-management",
//     filterKey: "public",
//     name: "Workplan task management",
//     headerTitle: "מערכת לניהול משימות מתוך תכנית עבודה",
//     tags: [
//       { title: "מערכות לשיתוף ציבור" },
//       { title: "Eye Do" },
//       { title: "Eye Do" },
//       { title: "גני תקווה" },
//     ],
//     statuses: [{ label: "פעיל" }, { label: "חודש וחצי" }, { label: "2019" }],
//     mainArticles: [
//       {
//         description:
//           'לאגף שפ"ע יש המון תחומי אחריות וספר רב של קבלנים מצד אחד ומצד שני חוסר בקרה / תקנים. הנהיית ראש המועצה והמנכ"ל הייתה מקסימום פיקוח והתראה על הקבלנים השונים במינימום השקעה / כ"א, וזאת תוך הצגת עבודה איכותית וכשירה משפטית.',
//       },
//       {
//         description:
//           'מתוך כך, אופיינה המערכת בעזרת חברת "איידן", ופועלת מול כל מכרזי הקבלנים: גינון, חשמל, ניקיון, חישוב , ניקיון מוס"ח ובניי מתחנמות, אשפה וגזם (טלפלקציות וקבלנים). האפליקציה ניהול אשר נמצאת אצל פקח המועצה בשטח. תהליך עבודה: פקח רואה חריגה, הוא פותח את האפליקציה, בוחר בסוג החריגה, תיאור המקרה ותמונה. שעה, תאריך ומיקום נכנסים באופן אוטומטי כולל ציון GPS. בעקבות ההזנה, נשלח מייל אוטומטי לקבלן והעתק למנהל האגף, הקבלן, בזמן אמת חותם על הקנס, טופס זה קביל בבית המשפט ואין לקבלן אחר כך אפשרות להלין עליו.',
//       },
//       {
//         description:
//           "במידה והקבלן מבקש את הלקוח בידיי, שמורה לו הזכות להגיש ערעור ולבטל את הקנס. ההודעה היא למעשה דף פתיחה של הרשות המקומית בצירוף מיקום החריגה, תמונה, סוג חריגה וגובה הקנס אשר מחושב אוטומטית מאפייני החוזה מול הקבלן. כל הקנסות מרוכזים אצל מנהל האגף וכך הוא יכול לשלוף דוח חודשי, או לבדוק אחורה בזמן מגמת שיפור / נקודות לשיפור וכו'...המטרה בסופו של דבר היא להביא את הקבלנים לבצע את העבודה ולא לקנוס אותם, הקנסות הם כלי אחרון ואפקטיבי מאוד לשיפור איכות השירות והביצוע.",
//       },
//       {
//         description:
//           'מערכת חישובים באגף שפ"ע בלבד. אולם אגף שפ"ע מעצב ערך מורחב וכולל מלבד לתחומי האחריות הקלאסיים של אגף שפ"ע: אחזקת מבני ציבור, אחזקת חשמל תאורת רחובות, בניין שיפוצים, אחזקת כבישים ומדרכות, אחזקת מתקני משחק וספסלים, פיקוח עירוני, וטרינריה, אחזקת מוסדות חינוך, איכות הסביבה, תחבורה, פרוייקטים, תנועה ומחזור.',
//       },
//       {
//         description:
//           "המחלך נעשה כהליכה מרהיבה רחבה של ראש המועצה אל עבר דיגיטל ורובו אלד חדשות בכל תחומי העשייה והנהגה בין היתר למקסימום דיגיטציה בעבודת הרשות.",
//       },
//     ],
//     suitable: "כולן.",
//     recommendations:
//       'המערכת ידידותית למשתמש וניתן להפעילה גם ע"י איש צוות אחראי יחיד. ניתן ואף מומלץ להגדיר בחלקן מן התהליכים שתהיה אחראי על תפקיד ויעלו רק באישור. כן, מומלץ להגדיר בעל תפקיד שיהיה אחראי על הסוגיה הנבחנת, למשל: אגף הדוברות, קשרי קהילה וכו. בנוסף, מומלץ לקיים תהליך הקמה משמעותי עם החברה בשלב אפיון הצרכים והמערכת. החברה מספקת את הייעוץ הנדרש וכדאי להעמיק בשלב זה. מומלץ לבחון האם בעיסוק בשאלות וסוגיות אסטרטגיות ורגישות, כדאי להסתייע בייעוץ חיצוני ובאגף הדוברות של הרשות המקומית.',
//     contacts: {
//       title: "רשות מקומית",
//       name: "נהומי חי",
//       role: "מנהל אגף קשרי קהילה, דוברות והסברה",
//       email: "nahumi@gantik.org.il",
//     },
//     providerBlock: {
//       title: "topsolutions",
//       iconSrc: "/images/webp/projects/provider/topsolutions.png",
//       articles: [
//         {
//           title: "שימושים ברשויות מקומיות",
//           description:
//             " תל אביב-יפו, מועצה מקומית גני תקווה, ארגון הג'וינט למגזר החרדי בשיתוף עם רשויות מקומיות בנגב, ועוד",
//         },
//         {
//           title: "לקוחות נוספים",
//           description: "עמותת דרכנו, עמותת שיתופים ועוד",
//         },
//         { title: "איש קשר", description: ' ערן עיציון, מנכ"ל | 050-6205284' },
//         { title: " שנת הקמה", description: "2021" },
//       ],
//       emails: [{ title: "eran@raizit.com" }, { title: "www.raizit.com" }],
//     },
//     contactBlock: {
//       title: "מעוניין לבצע את הפרויקט הזה באזורך?",
//     },
//     slider: [
//       { imageSrc: "/images/webp/projects/slider/task-budg-manag-1.png" },
//       { imageSrc: "/images/webp/projects/slider/task-budg-manag-1.png" },
//       { imageSrc: "/images/webp/projects/slider/task-budg-manag-1.png" },
//       { imageSrc: "/images/webp/projects/slider/task-budg-manag-1.png" },
//     ],
//   },
//   "meeting-task-management": {
//     id: "meeting-task-management",
//     filterKey: "public",
//     name: "Workplan task management",
//     headerTitle: "מערכת לניהול משימות מתוך תכנית עבודה",
//     tags: [
//       { title: "מערכות לשיתוף ציבור" },
//       { title: "Eye Do" },
//       { title: "Eye Do" },
//       { title: "גני תקווה" },
//     ],
//     statuses: [{ label: "פעיל" }, { label: "חודש וחצי" }, { label: "2019" }],
//     mainArticles: [
//       {
//         description:
//           'לאגף שפ"ע יש המון תחומי אחריות וספר רב של קבלנים מצד אחד ומצד שני חוסר בקרה / תקנים. הנהיית ראש המועצה והמנכ"ל הייתה מקסימום פיקוח והתראה על הקבלנים השונים במינימום השקעה / כ"א, וזאת תוך הצגת עבודה איכותית וכשירה משפטית.',
//       },
//       {
//         description:
//           'מתוך כך, אופיינה המערכת בעזרת חברת "איידן", ופועלת מול כל מכרזי הקבלנים: גינון, חשמל, ניקיון, חישוב , ניקיון מוס"ח ובניי מתחנמות, אשפה וגזם (טלפלקציות וקבלנים). האפליקציה ניהול אשר נמצאת אצל פקח המועצה בשטח. תהליך עבודה: פקח רואה חריגה, הוא פותח את האפליקציה, בוחר בסוג החריגה, תיאור המקרה ותמונה. שעה, תאריך ומיקום נכנסים באופן אוטומטי כולל ציון GPS. בעקבות ההזנה, נשלח מייל אוטומטי לקבלן והעתק למנהל האגף, הקבלן, בזמן אמת חותם על הקנס, טופס זה קביל בבית המשפט ואין לקבלן אחר כך אפשרות להלין עליו.',
//       },
//       {
//         description:
//           "במידה והקבלן מבקש את הלקוח בידיי, שמורה לו הזכות להגיש ערעור ולבטל את הקנס. ההודעה היא למעשה דף פתיחה של הרשות המקומית בצירוף מיקום החריגה, תמונה, סוג חריגה וגובה הקנס אשר מחושב אוטומטית מאפייני החוזה מול הקבלן. כל הקנסות מרוכזים אצל מנהל האגף וכך הוא יכול לשלוף דוח חודשי, או לבדוק אחורה בזמן מגמת שיפור / נקודות לשיפור וכו'...המטרה בסופו של דבר היא להביא את הקבלנים לבצע את העבודה ולא לקנוס אותם, הקנסות הם כלי אחרון ואפקטיבי מאוד לשיפור איכות השירות והביצוע.",
//       },
//       {
//         description:
//           'מערכת חישובים באגף שפ"ע בלבד. אולם אגף שפ"ע מעצב ערך מורחב וכולל מלבד לתחומי האחריות הקלאסיים של אגף שפ"ע: אחזקת מבני ציבור, אחזקת חשמל תאורת רחובות, בניין שיפוצים, אחזקת כבישים ומדרכות, אחזקת מתקני משחק וספסלים, פיקוח עירוני, וטרינריה, אחזקת מוסדות חינוך, איכות הסביבה, תחבורה, פרוייקטים, תנועה ומחזור.',
//       },
//       {
//         description:
//           "המחלך נעשה כהליכה מרהיבה רחבה של ראש המועצה אל עבר דיגיטל ורובו אלד חדשות בכל תחומי העשייה והנהגה בין היתר למקסימום דיגיטציה בעבודת הרשות.",
//       },
//     ],
//     suitable: "כולן.",
//     recommendations:
//       'המערכת ידידותית למשתמש וניתן להפעילה גם ע"י איש צוות אחראי יחיד. ניתן ואף מומלץ להגדיר בחלקן מן התהליכים שתהיה אחראי על תפקיד ויעלו רק באישור. כן, מומלץ להגדיר בעל תפקיד שיהיה אחראי על הסוגיה הנבחנת, למשל: אגף הדוברות, קשרי קהילה וכו. בנוסף, מומלץ לקיים תהליך הקמה משמעותי עם החברה בשלב אפיון הצרכים והמערכת. החברה מספקת את הייעוץ הנדרש וכדאי להעמיק בשלב זה. מומלץ לבחון האם בעיסוק בשאלות וסוגיות אסטרטגיות ורגישות, כדאי להסתייע בייעוץ חיצוני ובאגף הדוברות של הרשות המקומית.',
//     contacts: {
//       title: "רשות מקומית",
//       name: "נהומי חי",
//       role: "מנהל אגף קשרי קהילה, דוברות והסברה",
//       email: "nahumi@gantik.org.il",
//     },
//     providerBlock: {
//       title: "topsolutions",
//       iconSrc: "/images/webp/projects/provider/topsolutions.png",
//       articles: [
//         {
//           title: "שימושים ברשויות מקומיות",
//           description:
//             " תל אביב-יפו, מועצה מקומית גני תקווה, ארגון הג'וינט למגזר החרדי בשיתוף עם רשויות מקומיות בנגב, ועוד",
//         },
//         {
//           title: "לקוחות נוספים",
//           description: "עמותת דרכנו, עמותת שיתופים ועוד",
//         },
//         { title: "איש קשר", description: ' ערן עיציון, מנכ"ל | 050-6205284' },
//         { title: " שנת הקמה", description: "2021" },
//       ],
//       emails: [{ title: "eran@raizit.com" }, { title: "www.raizit.com" }],
//     },
//     contactBlock: {
//       title: "מעוניין לבצע את הפרויקט הזה באזורך?",
//     },
//     slider: [
//       { imageSrc: "/images/webp/projects/slider/meeting-task-1.png" },
//       { imageSrc: "/images/webp/projects/slider/meeting-task-1.png" },
//       { imageSrc: "/images/webp/projects/slider/meeting-task-1.png" },
//       { imageSrc: "/images/webp/projects/slider/meeting-task-1.png" },
//     ],
//   },
//   "workplan-task-management": {
//     id: "workplan-task-management",
//     filterKey: "public",
//     name: "Workplan task management",
//     headerTitle: "מערכת לניהול משימות מתוך תכנית עבודה",
//     tags: [
//       { title: "מערכות לשיתוף ציבור" },
//       { title: "topsolutions" },
//       { title: "Action Base" },
//       { title: "גני תקווה" },
//     ],
//     statuses: [{ label: "פעיל" }, { label: "חודש וחצי" }, { label: "2019" }],
//     mainArticles: [
//       {
//         description:
//           "מועצה מקומית גני תקווה זיהתה את חשיבות שיתוף תושבים בעיצוב חייהם וקבלת החלטה. לאור הבנה זו, לקיום הליכי שיתוף ציבור משמעותיים ואיכותיים. על-מנת לקדם את שיתוף הציבור, הרשות המקומית מפעילה תשתית דיגיטלית, שבמסגרתה ניתן ליצור מגוון חווייתיות ותהליכים בנושאי אסטרטגיה, תכנון עירוני, תרבות, בריאות, כלכלה מקומית ובכל נושא אחר בו הרשות המקומית עוסקת.",
//       },
//       {
//         description:
//           "התהליכים הם רב שלביים ומלווים את הפרויקט משלב חשיפת הנושא באופן ויזואלי ועד הצגת תוצאות וישום התובנות שעלו מהליך שיתוף הציבור. כל התהליכים נשמרים במערכת וניתנים לצפייה על-ידי התושבים ובעלי העניין בכל זמן נתון. כמו כן, המערכת יוצרת פילוח על-פי תחומי עניין עבור התושב ומציעה לו להשתתף בתהליכים שעשויים לעניין אותו על-פי המידע הקיים עליו במרחב האישי.",
//       },
//       {
//         description:
//           "יישום נוסף הוא שימוש בשכבת מידע גיאוגרפי – התושבים יכולים לראות תהליכי שיתוף ציבור שעשיינו אותם מבחינת הקרבה הגיאוגרפית. הרשות המקומית בעלת גמישות מוחלטת בשימוש במערכת: צורך ואופן הליך שיתוף הציבור, סוג השאלות, הבחירה בין תצוגות, מיקום גיאוגרפי ועוד.",
//       },
//       {
//         description:
//           'תהליך שיתוף הציבור הראשון שקידמה המועצה המקומית גני תקווה עסק בסוגיה האסטרטגית של מעבר מטשטוש של מועצה מאות תושבים לתהליך פניות תושבים בהיקף נרחב – תהליך שיתוף הציבור השני עסק בהקמת אזור המאפשר התעסוקה מגוונת תוך התמקדות בתעסוקה הממוקדת ביותר, על-מנת לספק פתרון ביניים בין עבודה מרחוק לעבודה פיזית למרחקים של עשרות ק"מ.',
//       },
//     ],
//     suitable: "כולן.",
//     recommendations:
//       'המערכת ידידותית למשתמש וניתן להפעילה גם ע"י איש צוות אחראי יחיד. ניתן ואף מומלץ להגדיר בחלקן מן התהליכים שתהיה אחראי על תפקיד ויעלו רק באישור. כן, מומלץ להגדיר בעל תפקיד שיהיה אחראי על הסוגיה הנבחנת, למשל: אגף הדוברות, קשרי קהילה וכו. בנוסף, מומלץ לקיים תהליך הקמה משמעותי עם החברה בשלב אפיון הצרכים והמערכת. החברה מספקת את הייעוץ הנדרש וכדאי להעמיק בשלב זה. מומלץ לבחון האם בעיסוק בשאלות וסוגיות אסטרטגיות ורגישות, כדאי להסתייע בייעוץ חיצוני ובאגף הדוברות של הרשות המקומית.',
//     contacts: {
//       title: "רשות מקומית",
//       name: "נהומי חי",
//       role: "מנהל אגף קשרי קהילה, דוברות והסברה",
//       email: "nahumi@gantik.org.il",
//     },
//     providerBlock: {
//       title: "topsolutions",
//       iconSrc: "/images/webp/projects/provider/topsolutions.png",
//       articles: [
//         {
//           title: "שימושים ברשויות מקומיות",
//           description:
//             " תל אביב-יפו, מועצה מקומית גני תקווה, ארגון הג'וינט למגזר החרדי בשיתוף עם רשויות מקומיות בנגב, ועוד",
//         },
//         {
//           title: "לקוחות נוספים",
//           description: "עמותת דרכנו, עמותת שיתופים ועוד",
//         },
//         { title: "איש קשר", description: ' ערן עיציון, מנכ"ל | 050-6205284' },
//         { title: " שנת הקמה", description: "2021" },
//       ],
//       emails: [{ title: "eran@raizit.com" }, { title: "www.raizit.com" }],
//     },
//     contactBlock: {
//       title: "מעוניין לבצע את הפרויקט הזה באזורך?",
//     },
//     slider: [
//       { imageSrc: "/images/webp/projects/slider/workplan-task-1.png" },
//       { imageSrc: "/images/webp/projects/slider/workplan-task-1.png" },
//       { imageSrc: "/images/webp/projects/slider/workplan-task-1.png" },
//       { imageSrc: "/images/webp/projects/slider/workplan-task-1.png" },
//     ],
//   },
//   "bi-system": {
//     id: "bi-system",
//     filterKey: "business",
//     name: "Workplan task management",
//     headerTitle: "מערכת לניהול משימות מתוך תכנית עבודה",
//     tags: [
//       { title: "מערכות לשיתוף ציבור" },
//       { title: "topsolutions" },
//       { title: "Action Base" },
//       { title: "גני תקווה" },
//     ],
//     statuses: [{ label: "פעיל" }, { label: "חודש וחצי" }, { label: "2019" }],
//     mainArticles: [
//       {
//         description:
//           "מועצה מקומית גני תקווה זיהתה את חשיבות שיתוף תושבים בעיצוב חייהם וקבלת החלטה. לאור הבנה זו, לקיום הליכי שיתוף ציבור משמעותיים ואיכותיים. על-מנת לקדם את שיתוף הציבור, הרשות המקומית מפעילה תשתית דיגיטלית, שבמסגרתה ניתן ליצור מגוון חווייתיות ותהליכים בנושאי אסטרטגיה, תכנון עירוני, תרבות, בריאות, כלכלה מקומית ובכל נושא אחר בו הרשות המקומית עוסקת.",
//       },
//       {
//         description:
//           "התהליכים הם רב שלביים ומלווים את הפרויקט משלב חשיפת הנושא באופן ויזואלי ועד הצגת תוצאות וישום התובנות שעלו מהליך שיתוף הציבור. כל התהליכים נשמרים במערכת וניתנים לצפייה על-ידי התושבים ובעלי העניין בכל זמן נתון. כמו כן, המערכת יוצרת פילוח על-פי תחומי עניין עבור התושב ומציעה לו להשתתף בתהליכים שעשויים לעניין אותו על-פי המידע הקיים עליו במרחב האישי.",
//       },
//       {
//         description:
//           "יישום נוסף הוא שימוש בשכבת מידע גיאוגרפי – התושבים יכולים לראות תהליכי שיתוף ציבור שעשיינו אותם מבחינת הקרבה הגיאוגרפית. הרשות המקומית בעלת גמישות מוחלטת בשימוש במערכת: צורך ואופן הליך שיתוף הציבור, סוג השאלות, הבחירה בין תצוגות, מיקום גיאוגרפי ועוד.",
//       },
//       {
//         description:
//           'תהליך שיתוף הציבור הראשון שקידמה המועצה המקומית גני תקווה עסק בסוגיה האסטרטגית של מעבר מטשטוש של מועצה מאות תושבים לתהליך פניות תושבים בהיקף נרחב – תהליך שיתוף הציבור השני עסק בהקמת אזור המאפשר התעסוקה מגוונת תוך התמקדות בתעסוקה הממוקדת ביותר, על-מנת לספק פתרון ביניים בין עבודה מרחוק לעבודה פיזית למרחקים של עשרות ק"מ.',
//       },
//     ],
//     suitable: "כולן.",
//     recommendations:
//       'המערכת ידידותית למשתמש וניתן להפעילה גם ע"י איש צוות אחראי יחיד. ניתן ואף מומלץ להגדיר בחלקן מן התהליכים שתהיה אחראי על תפקיד ויעלו רק באישור. כן, מומלץ להגדיר בעל תפקיד שיהיה אחראי על הסוגיה הנבחנת, למשל: אגף הדוברות, קשרי קהילה וכו. בנוסף, מומלץ לקיים תהליך הקמה משמעותי עם החברה בשלב אפיון הצרכים והמערכת. החברה מספקת את הייעוץ הנדרש וכדאי להעמיק בשלב זה. מומלץ לבחון האם בעיסוק בשאלות וסוגיות אסטרטגיות ורגישות, כדאי להסתייע בייעוץ חיצוני ובאגף הדוברות של הרשות המקומית.',
//     contacts: {
//       title: "רשות מקומית",
//       name: "נהומי חי",
//       role: "מנהל אגף קשרי קהילה, דוברות והסברה",
//       email: "nahumi@gantik.org.il",
//     },
//     providerBlock: {
//       title: "topsolutions",
//       iconSrc: "/images/webp/projects/provider/topsolutions.png",
//       articles: [
//         {
//           title: "שימושים ברשויות מקומיות",
//           description:
//             " תל אביב-יפו, מועצה מקומית גני תקווה, ארגון הג'וינט למגזר החרדי בשיתוף עם רשויות מקומיות בנגב, ועוד",
//         },
//         {
//           title: "לקוחות נוספים",
//           description: "עמותת דרכנו, עמותת שיתופים ועוד",
//         },
//         { title: "איש קשר", description: ' ערן עיציון, מנכ"ל | 050-6205284' },
//         { title: " שנת הקמה", description: "2021" },
//       ],
//       emails: [{ title: "eran@raizit.com" }, { title: "www.raizit.com" }],
//     },
//     contactBlock: {
//       title: "מעוניין לבצע את הפרויקט הזה באזורך?",
//     },
//     slider: [
//       { imageSrc: "/images/webp/projects/slider/bi-system-1.png" },
//       { imageSrc: "/images/webp/projects/slider/bi-system-1.png" },
//       { imageSrc: "/images/webp/projects/slider/bi-system-1.png" },
//       { imageSrc: "/images/webp/projects/slider/bi-system-1.png" },
//     ],
//   },
//   "decision-support": {
//     id: "decision-support",
//     filterKey: "business",
//     name: "Workplan task management",
//     headerTitle: "מערכת לניהול משימות מתוך תכנית עבודה",
//     tags: [
//       { title: "מערכות לשיתוף ציבור" },
//       { title: "topsolutions" },
//       { title: "Action Base" },
//       { title: "גני תקווה" },
//     ],
//     statuses: [{ label: "פעיל" }, { label: "חודש וחצי" }, { label: "2019" }],
//     mainArticles: [
//       {
//         description:
//           "מועצה מקומית גני תקווה זיהתה את חשיבות שיתוף תושבים בעיצוב חייהם וקבלת החלטה. לאור הבנה זו, לקיום הליכי שיתוף ציבור משמעותיים ואיכותיים. על-מנת לקדם את שיתוף הציבור, הרשות המקומית מפעילה תשתית דיגיטלית, שבמסגרתה ניתן ליצור מגוון חווייתיות ותהליכים בנושאי אסטרטגיה, תכנון עירוני, תרבות, בריאות, כלכלה מקומית ובכל נושא אחר בו הרשות המקומית עוסקת.",
//       },
//       {
//         description:
//           "התהליכים הם רב שלביים ומלווים את הפרויקט משלב חשיפת הנושא באופן ויזואלי ועד הצגת תוצאות וישום התובנות שעלו מהליך שיתוף הציבור. כל התהליכים נשמרים במערכת וניתנים לצפייה על-ידי התושבים ובעלי העניין בכל זמן נתון. כמו כן, המערכת יוצרת פילוח על-פי תחומי עניין עבור התושב ומציעה לו להשתתף בתהליכים שעשויים לעניין אותו על-פי המידע הקיים עליו במרחב האישי.",
//       },
//       {
//         description:
//           "יישום נוסף הוא שימוש בשכבת מידע גיאוגרפי – התושבים יכולים לראות תהליכי שיתוף ציבור שעשיינו אותם מבחינת הקרבה הגיאוגרפית. הרשות המקומית בעלת גמישות מוחלטת בשימוש במערכת: צורך ואופן הליך שיתוף הציבור, סוג השאלות, הבחירה בין תצוגות, מיקום גיאוגרפי ועוד.",
//       },
//       {
//         description:
//           'תהליך שיתוף הציבור הראשון שקידמה המועצה המקומית גני תקווה עסק בסוגיה האסטרטגית של מעבר מטשטוש של מועצה מאות תושבים לתהליך פניות תושבים בהיקף נרחב – תהליך שיתוף הציבור השני עסק בהקמת אזור המאפשר התעסוקה מגוונת תוך התמקדות בתעסוקה הממוקדת ביותר, על-מנת לספק פתרון ביניים בין עבודה מרחוק לעבודה פיזית למרחקים של עשרות ק"מ.',
//       },
//     ],
//     suitable: "כולן.",
//     recommendations:
//       'המערכת ידידותית למשתמש וניתן להפעילה גם ע"י איש צוות אחראי יחיד. ניתן ואף מומלץ להגדיר בחלקן מן התהליכים שתהיה אחראי על תפקיד ויעלו רק באישור. כן, מומלץ להגדיר בעל תפקיד שיהיה אחראי על הסוגיה הנבחנת, למשל: אגף הדוברות, קשרי קהילה וכו. בנוסף, מומלץ לקיים תהליך הקמה משמעותי עם החברה בשלב אפיון הצרכים והמערכת. החברה מספקת את הייעוץ הנדרש וכדאי להעמיק בשלב זה. מומלץ לבחון האם בעיסוק בשאלות וסוגיות אסטרטגיות ורגישות, כדאי להסתייע בייעוץ חיצוני ובאגף הדוברות של הרשות המקומית.',
//     contacts: {
//       title: "רשות מקומית",
//       name: "נהומי חי",
//       role: "מנהל אגף קשרי קהילה, דוברות והסברה",
//       email: "nahumi@gantik.org.il",
//     },
//     providerBlock: {
//       title: "topsolutions",
//       iconSrc: "/images/webp/projects/provider/topsolutions.png",
//       articles: [
//         {
//           title: "שימושים ברשויות מקומיות",
//           description:
//             " תל אביב-יפו, מועצה מקומית גני תקווה, ארגון הג'וינט למגזר החרדי בשיתוף עם רשויות מקומיות בנגב, ועוד",
//         },
//         {
//           title: "לקוחות נוספים",
//           description: "עמותת דרכנו, עמותת שיתופים ועוד",
//         },
//         { title: "איש קשר", description: ' ערן עיציון, מנכ"ל | 050-6205284' },
//         { title: " שנת הקמה", description: "2021" },
//       ],
//       emails: [{ title: "eran@raizit.com" }, { title: "www.raizit.com" }],
//     },
//     contactBlock: {
//       title: "מעוניין לבצע את הפרויקט הזה באזורך?",
//     },
//     slider: [
//       { imageSrc: "/images/webp/projects/slider/decision-1.png" },
//       { imageSrc: "/images/webp/projects/slider/decision-1.png" },
//       { imageSrc: "/images/webp/projects/slider/decision-1.png" },
//       { imageSrc: "/images/webp/projects/slider/decision-1.png" },
//     ],
//   },
//   "regional-center": {
//     id: "regional-center",
//     filterKey: "business",
//     name: "Workplan task management",
//     headerTitle: "מערכת לניהול משימות מתוך תכנית עבודה",
//     tags: [
//       { title: "מערכות לשיתוף ציבור" },
//       { title: "topsolutions" },
//       { title: "Action Base" },
//       { title: "גני תקווה" },
//     ],
//     statuses: [{ label: "פעיל" }, { label: "חודש וחצי" }, { label: "2019" }],
//     mainArticles: [
//       {
//         description:
//           "מועצה מקומית גני תקווה זיהתה את חשיבות שיתוף תושבים בעיצוב חייהם וקבלת החלטה. לאור הבנה זו, לקיום הליכי שיתוף ציבור משמעותיים ואיכותיים. על-מנת לקדם את שיתוף הציבור, הרשות המקומית מפעילה תשתית דיגיטלית, שבמסגרתה ניתן ליצור מגוון חווייתיות ותהליכים בנושאי אסטרטגיה, תכנון עירוני, תרבות, בריאות, כלכלה מקומית ובכל נושא אחר בו הרשות המקומית עוסקת.",
//       },
//       {
//         description:
//           "התהליכים הם רב שלביים ומלווים את הפרויקט משלב חשיפת הנושא באופן ויזואלי ועד הצגת תוצאות וישום התובנות שעלו מהליך שיתוף הציבור. כל התהליכים נשמרים במערכת וניתנים לצפייה על-ידי התושבים ובעלי העניין בכל זמן נתון. כמו כן, המערכת יוצרת פילוח על-פי תחומי עניין עבור התושב ומציעה לו להשתתף בתהליכים שעשויים לעניין אותו על-פי המידע הקיים עליו במרחב האישי.",
//       },
//       {
//         description:
//           "יישום נוסף הוא שימוש בשכבת מידע גיאוגרפי – התושבים יכולים לראות תהליכי שיתוף ציבור שעשיינו אותם מבחינת הקרבה הגיאוגרפית. הרשות המקומית בעלת גמישות מוחלטת בשימוש במערכת: צורך ואופן הליך שיתוף הציבור, סוג השאלות, הבחירה בין תצוגות, מיקום גיאוגרפי ועוד.",
//       },
//       {
//         description:
//           'תהליך שיתוף הציבור הראשון שקידמה המועצה המקומית גני תקווה עסק בסוגיה האסטרטגית של מעבר מטשטוש של מועצה מאות תושבים לתהליך פניות תושבים בהיקף נרחב – תהליך שיתוף הציבור השני עסק בהקמת אזור המאפשר התעסוקה מגוונת תוך התמקדות בתעסוקה הממוקדת ביותר, על-מנת לספק פתרון ביניים בין עבודה מרחוק לעבודה פיזית למרחקים של עשרות ק"מ.',
//       },
//     ],
//     suitable: "כולן.",
//     recommendations:
//       'המערכת ידידותית למשתמש וניתן להפעילה גם ע"י איש צוות אחראי יחיד. ניתן ואף מומלץ להגדיר בחלקן מן התהליכים שתהיה אחראי על תפקיד ויעלו רק באישור. כן, מומלץ להגדיר בעל תפקיד שיהיה אחראי על הסוגיה הנבחנת, למשל: אגף הדוברות, קשרי קהילה וכו. בנוסף, מומלץ לקיים תהליך הקמה משמעותי עם החברה בשלב אפיון הצרכים והמערכת. החברה מספקת את הייעוץ הנדרש וכדאי להעמיק בשלב זה. מומלץ לבחון האם בעיסוק בשאלות וסוגיות אסטרטגיות ורגישות, כדאי להסתייע בייעוץ חיצוני ובאגף הדוברות של הרשות המקומית.',
//     contacts: {
//       title: "רשות מקומית",
//       name: "נהומי חי",
//       role: "מנהל אגף קשרי קהילה, דוברות והסברה",
//       email: "nahumi@gantik.org.il",
//     },
//     providerBlock: {
//       title: "topsolutions",
//       iconSrc: "/images/webp/projects/provider/topsolutions.png",
//       articles: [
//         {
//           title: "שימושים ברשויות מקומיות",
//           description:
//             " תל אביב-יפו, מועצה מקומית גני תקווה, ארגון הג'וינט למגזר החרדי בשיתוף עם רשויות מקומיות בנגב, ועוד",
//         },
//         {
//           title: "לקוחות נוספים",
//           description: "עמותת דרכנו, עמותת שיתופים ועוד",
//         },
//         { title: "איש קשר", description: ' ערן עיציון, מנכ"ל | 050-6205284' },
//         { title: " שנת הקמה", description: "2021" },
//       ],
//       emails: [{ title: "eran@raizit.com" }, { title: "www.raizit.com" }],
//     },
//     contactBlock: {
//       title: "מעוניין לבצע את הפרויקט הזה באזורך?",
//     },
//     slider: [
//       { imageSrc: "/images/webp/projects/slider/regional-center-1.png" },
//       { imageSrc: "/images/webp/projects/slider/regional-center-1.png" },
//       { imageSrc: "/images/webp/projects/slider/regional-center-1.png" },
//     ],
//   },
//   "ashdod-communities": {
//     id: "ashdod-communities",
//     filterKey: "management",
//     name: "Workplan task management",
//     headerTitle: "מערכת לניהול משימות מתוך תכנית עבודה",
//     tags: [
//       { title: "מערכות לשיתוף ציבור" },
//       { title: "topsolutions" },
//       { title: "Action Base" },
//       { title: "גני תקווה" },
//     ],
//     statuses: [{ label: "פעיל" }, { label: "חודש וחצי" }, { label: "2019" }],
//     mainArticles: [
//       {
//         description:
//           "מועצה מקומית גני תקווה זיהתה את חשיבות שיתוף תושבים בעיצוב חייהם וקבלת החלטה. לאור הבנה זו, לקיום הליכי שיתוף ציבור משמעותיים ואיכותיים. על-מנת לקדם את שיתוף הציבור, הרשות המקומית מפעילה תשתית דיגיטלית, שבמסגרתה ניתן ליצור מגוון חווייתיות ותהליכים בנושאי אסטרטגיה, תכנון עירוני, תרבות, בריאות, כלכלה מקומית ובכל נושא אחר בו הרשות המקומית עוסקת.",
//       },
//       {
//         description:
//           "התהליכים הם רב שלביים ומלווים את הפרויקט משלב חשיפת הנושא באופן ויזואלי ועד הצגת תוצאות וישום התובנות שעלו מהליך שיתוף הציבור. כל התהליכים נשמרים במערכת וניתנים לצפייה על-ידי התושבים ובעלי העניין בכל זמן נתון. כמו כן, המערכת יוצרת פילוח על-פי תחומי עניין עבור התושב ומציעה לו להשתתף בתהליכים שעשויים לעניין אותו על-פי המידע הקיים עליו במרחב האישי.",
//       },
//       {
//         description:
//           "יישום נוסף הוא שימוש בשכבת מידע גיאוגרפי – התושבים יכולים לראות תהליכי שיתוף ציבור שעשיינו אותם מבחינת הקרבה הגיאוגרפית. הרשות המקומית בעלת גמישות מוחלטת בשימוש במערכת: צורך ואופן הליך שיתוף הציבור, סוג השאלות, הבחירה בין תצוגות, מיקום גיאוגרפי ועוד.",
//       },
//       {
//         description:
//           'תהליך שיתוף הציבור הראשון שקידמה המועצה המקומית גני תקווה עסק בסוגיה האסטרטגית של מעבר מטשטוש של מועצה מאות תושבים לתהליך פניות תושבים בהיקף נרחב – תהליך שיתוף הציבור השני עסק בהקמת אזור המאפשר התעסוקה מגוונת תוך התמקדות בתעסוקה הממוקדת ביותר, על-מנת לספק פתרון ביניים בין עבודה מרחוק לעבודה פיזית למרחקים של עשרות ק"מ.',
//       },
//     ],
//     suitable: "כולן.",
//     recommendations:
//       'המערכת ידידותית למשתמש וניתן להפעילה גם ע"י איש צוות אחראי יחיד. ניתן ואף מומלץ להגדיר בחלקן מן התהליכים שתהיה אחראי על תפקיד ויעלו רק באישור. כן, מומלץ להגדיר בעל תפקיד שיהיה אחראי על הסוגיה הנבחנת, למשל: אגף הדוברות, קשרי קהילה וכו. בנוסף, מומלץ לקיים תהליך הקמה משמעותי עם החברה בשלב אפיון הצרכים והמערכת. החברה מספקת את הייעוץ הנדרש וכדאי להעמיק בשלב זה. מומלץ לבחון האם בעיסוק בשאלות וסוגיות אסטרטגיות ורגישות, כדאי להסתייע בייעוץ חיצוני ובאגף הדוברות של הרשות המקומית.',
//     contacts: {
//       title: "רשות מקומית",
//       name: "נהומי חי",
//       role: "מנהל אגף קשרי קהילה, דוברות והסברה",
//       email: "nahumi@gantik.org.il",
//     },
//     providerBlock: {
//       title: "topsolutions",
//       iconSrc: "/images/webp/projects/provider/topsolutions.png",
//       articles: [
//         {
//           title: "שימושים ברשויות מקומיות",
//           description:
//             " תל אביב-יפו, מועצה מקומית גני תקווה, ארגון הג'וינט למגזר החרדי בשיתוף עם רשויות מקומיות בנגב, ועוד",
//         },
//         {
//           title: "לקוחות נוספים",
//           description: "עמותת דרכנו, עמותת שיתופים ועוד",
//         },
//         { title: "איש קשר", description: ' ערן עיציון, מנכ"ל | 050-6205284' },
//         { title: " שנת הקמה", description: "2021" },
//       ],
//       emails: [{ title: "eran@raizit.com" }, { title: "www.raizit.com" }],
//     },
//     contactBlock: {
//       title: "מעוניין לבצע את הפרויקט הזה באזורך?",
//     },
//     slider: [
//       { imageSrc: "/images/webp/projects/slider/community-1.png" },
//       { imageSrc: "/images/webp/projects/slider/regional-center-1.png" },
//     ],
//   },
//   "smart-waste": {
//     id: "smart-waste",
//     filterKey: "waste",
//     name: "Workplan task management",
//     headerTitle: "מערכת לניהול משימות מתוך תכנית עבודה",
//     tags: [
//       { title: "מערכות לשיתוף ציבור" },
//       { title: "topsolutions" },
//       { title: "Action Base" },
//       { title: "גני תקווה" },
//     ],
//     statuses: [{ label: "פעיל" }, { label: "חודש וחצי" }, { label: "2019" }],
//     mainArticles: [
//       {
//         description:
//           "מועצה מקומית גני תקווה זיהתה את חשיבות שיתוף תושבים בעיצוב חייהם וקבלת החלטה. לאור הבנה זו, לקיום הליכי שיתוף ציבור משמעותיים ואיכותיים. על-מנת לקדם את שיתוף הציבור, הרשות המקומית מפעילה תשתית דיגיטלית, שבמסגרתה ניתן ליצור מגוון חווייתיות ותהליכים בנושאי אסטרטגיה, תכנון עירוני, תרבות, בריאות, כלכלה מקומית ובכל נושא אחר בו הרשות המקומית עוסקת.",
//       },
//       {
//         description:
//           "התהליכים הם רב שלביים ומלווים את הפרויקט משלב חשיפת הנושא באופן ויזואלי ועד הצגת תוצאות וישום התובנות שעלו מהליך שיתוף הציבור. כל התהליכים נשמרים במערכת וניתנים לצפייה על-ידי התושבים ובעלי העניין בכל זמן נתון. כמו כן, המערכת יוצרת פילוח על-פי תחומי עניין עבור התושב ומציעה לו להשתתף בתהליכים שעשויים לעניין אותו על-פי המידע הקיים עליו במרחב האישי.",
//       },
//       {
//         description:
//           "יישום נוסף הוא שימוש בשכבת מידע גיאוגרפי – התושבים יכולים לראות תהליכי שיתוף ציבור שעשיינו אותם מבחינת הקרבה הגיאוגרפית. הרשות המקומית בעלת גמישות מוחלטת בשימוש במערכת: צורך ואופן הליך שיתוף הציבור, סוג השאלות, הבחירה בין תצוגות, מיקום גיאוגרפי ועוד.",
//       },
//       {
//         description:
//           'תהליך שיתוף הציבור הראשון שקידמה המועצה המקומית גני תקווה עסק בסוגיה האסטרטגית של מעבר מטשטוש של מועצה מאות תושבים לתהליך פניות תושבים בהיקף נרחב – תהליך שיתוף הציבור השני עסק בהקמת אזור המאפשר התעסוקה מגוונת תוך התמקדות בתעסוקה הממוקדת ביותר, על-מנת לספק פתרון ביניים בין עבודה מרחוק לעבודה פיזית למרחקים של עשרות ק"מ.',
//       },
//     ],
//     suitable: "כולן.",
//     recommendations:
//       'המערכת ידידותית למשתמש וניתן להפעילה גם ע"י איש צוות אחראי יחיד. ניתן ואף מומלץ להגדיר בחלקן מן התהליכים שתהיה אחראי על תפקיד ויעלו רק באישור. כן, מומלץ להגדיר בעל תפקיד שיהיה אחראי על הסוגיה הנבחנת, למשל: אגף הדוברות, קשרי קהילה וכו. בנוסף, מומלץ לקיים תהליך הקמה משמעותי עם החברה בשלב אפיון הצרכים והמערכת. החברה מספקת את הייעוץ הנדרש וכדאי להעמיק בשלב זה. מומלץ לבחון האם בעיסוק בשאלות וסוגיות אסטרטגיות ורגישות, כדאי להסתייע בייעוץ חיצוני ובאגף הדוברות של הרשות המקומית.',
//     contacts: {
//       title: "רשות מקומית",
//       name: "נהומי חי",
//       role: "מנהל אגף קשרי קהילה, דוברות והסברה",
//       email: "nahumi@gantik.org.il",
//     },
//     providerBlock: {
//       title: "topsolutions",
//       iconSrc: "/images/webp/projects/provider/topsolutions.png",
//       articles: [
//         {
//           title: "שימושים ברשויות מקומיות",
//           description:
//             " תל אביב-יפו, מועצה מקומית גני תקווה, ארגון הג'וינט למגזר החרדי בשיתוף עם רשויות מקומיות בנגב, ועוד",
//         },
//         {
//           title: "לקוחות נוספים",
//           description: "עמותת דרכנו, עמותת שיתופים ועוד",
//         },
//         { title: "איש קשר", description: ' ערן עיציון, מנכ"ל | 050-6205284' },
//         { title: " שנת הקמה", description: "2021" },
//       ],
//       emails: [{ title: "eran@raizit.com" }, { title: "www.raizit.com" }],
//     },
//     contactBlock: {
//       title: "מעוניין לבצע את הפרויקט הזה באזורך?",
//     },
//     slider: [
//       { imageSrc: "/images/webp/projects/slider/smart-1.png" },
//       { imageSrc: "/images/webp/projects/slider/regional-center-1.png" },
//     ],
//   },
//   "bi-support-tool": {
//     id: "bi-support-tool",
//     filterKey: "business",
//     name: "Workplan task management",
//     headerTitle: "מערכת לניהול משימות מתוך תכנית עבודה",
//     tags: [
//       { title: "מערכות לשיתוף ציבור" },
//       { title: "topsolutions" },
//       { title: "Action Base" },
//       { title: "גני תקווה" },
//     ],
//     statuses: [{ label: "פעיל" }, { label: "חודש וחצי" }, { label: "2019" }],
//     mainArticles: [
//       {
//         description:
//           "מועצה מקומית גני תקווה זיהתה את חשיבות שיתוף תושבים בעיצוב חייהם וקבלת החלטה. לאור הבנה זו, לקיום הליכי שיתוף ציבור משמעותיים ואיכותיים. על-מנת לקדם את שיתוף הציבור, הרשות המקומית מפעילה תשתית דיגיטלית, שבמסגרתה ניתן ליצור מגוון חווייתיות ותהליכים בנושאי אסטרטגיה, תכנון עירוני, תרבות, בריאות, כלכלה מקומית ובכל נושא אחר בו הרשות המקומית עוסקת.",
//       },
//       {
//         description:
//           "התהליכים הם רב שלביים ומלווים את הפרויקט משלב חשיפת הנושא באופן ויזואלי ועד הצגת תוצאות וישום התובנות שעלו מהליך שיתוף הציבור. כל התהליכים נשמרים במערכת וניתנים לצפייה על-ידי התושבים ובעלי העניין בכל זמן נתון. כמו כן, המערכת יוצרת פילוח על-פי תחומי עניין עבור התושב ומציעה לו להשתתף בתהליכים שעשויים לעניין אותו על-פי המידע הקיים עליו במרחב האישי.",
//       },
//       {
//         description:
//           "יישום נוסף הוא שימוש בשכבת מידע גיאוגרפי – התושבים יכולים לראות תהליכי שיתוף ציבור שעשיינו אותם מבחינת הקרבה הגיאוגרפית. הרשות המקומית בעלת גמישות מוחלטת בשימוש במערכת: צורך ואופן הליך שיתוף הציבור, סוג השאלות, הבחירה בין תצוגות, מיקום גיאוגרפי ועוד.",
//       },
//       {
//         description:
//           'תהליך שיתוף הציבור הראשון שקידמה המועצה המקומית גני תקווה עסק בסוגיה האסטרטגית של מעבר מטשטוש של מועצה מאות תושבים לתהליך פניות תושבים בהיקף נרחב – תהליך שיתוף הציבור השני עסק בהקמת אזור המאפשר התעסוקה מגוונת תוך התמקדות בתעסוקה הממוקדת ביותר, על-מנת לספק פתרון ביניים בין עבודה מרחוק לעבודה פיזית למרחקים של עשרות ק"מ.',
//       },
//     ],
//     suitable: "כולן.",
//     recommendations:
//       'המערכת ידידותית למשתמש וניתן להפעילה גם ע"י איש צוות אחראי יחיד. ניתן ואף מומלץ להגדיר בחלקן מן התהליכים שתהיה אחראי על תפקיד ויעלו רק באישור. כן, מומלץ להגדיר בעל תפקיד שיהיה אחראי על הסוגיה הנבחנת, למשל: אגף הדוברות, קשרי קהילה וכו. בנוסף, מומלץ לקיים תהליך הקמה משמעותי עם החברה בשלב אפיון הצרכים והמערכת. החברה מספקת את הייעוץ הנדרש וכדאי להעמיק בשלב זה. מומלץ לבחון האם בעיסוק בשאלות וסוגיות אסטרטגיות ורגישות, כדאי להסתייע בייעוץ חיצוני ובאגף הדוברות של הרשות המקומית.',
//     contacts: {
//       title: "רשות מקומית",
//       name: "נהומי חי",
//       role: "מנהל אגף קשרי קהילה, דוברות והסברה",
//       email: "nahumi@gantik.org.il",
//     },
//     providerBlock: {
//       title: "topsolutions",
//       iconSrc: "/images/webp/projects/provider/topsolutions.png",
//       articles: [
//         {
//           title: "שימושים ברשויות מקומיות",
//           description:
//             " תל אביב-יפו, מועצה מקומית גני תקווה, ארגון הג'וינט למגזר החרדי בשיתוף עם רשויות מקומיות בנגב, ועוד",
//         },
//         {
//           title: "לקוחות נוספים",
//           description: "עמותת דרכנו, עמותת שיתופים ועוד",
//         },
//         { title: "איש קשר", description: ' ערן עיציון, מנכ"ל | 050-6205284' },
//         { title: " שנת הקמה", description: "2021" },
//       ],
//       emails: [{ title: "eran@raizit.com" }, { title: "www.raizit.com" }],
//     },
//     contactBlock: {
//       title: "מעוניין לבצע את הפרויקט הזה באזורך?",
//     },
//     slider: [{ imageSrc: "/images/webp/projects/slider/bi-support.png" }],
//   },
//   "ecocall-waste": {
//     id: "ecocall-waste",
//     filterKey: "waste",
//     name: "Workplan task management",
//     headerTitle: "מערכת לניהול משימות מתוך תכנית עבודה",
//     tags: [
//       { title: "מערכות לשיתוף ציבור" },
//       { title: "topsolutions" },
//       { title: "Action Base" },
//       { title: "גני תקווה" },
//     ],
//     statuses: [{ label: "פעיל" }, { label: "חודש וחצי" }, { label: "2019" }],
//     mainArticles: [
//       {
//         description:
//           "מועצה מקומית גני תקווה זיהתה את חשיבות שיתוף תושבים בעיצוב חייהם וקבלת החלטה. לאור הבנה זו, לקיום הליכי שיתוף ציבור משמעותיים ואיכותיים. על-מנת לקדם את שיתוף הציבור, הרשות המקומית מפעילה תשתית דיגיטלית, שבמסגרתה ניתן ליצור מגוון חווייתיות ותהליכים בנושאי אסטרטגיה, תכנון עירוני, תרבות, בריאות, כלכלה מקומית ובכל נושא אחר בו הרשות המקומית עוסקת.",
//       },
//       {
//         description:
//           "התהליכים הם רב שלביים ומלווים את הפרויקט משלב חשיפת הנושא באופן ויזואלי ועד הצגת תוצאות וישום התובנות שעלו מהליך שיתוף הציבור. כל התהליכים נשמרים במערכת וניתנים לצפייה על-ידי התושבים ובעלי העניין בכל זמן נתון. כמו כן, המערכת יוצרת פילוח על-פי תחומי עניין עבור התושב ומציעה לו להשתתף בתהליכים שעשויים לעניין אותו על-פי המידע הקיים עליו במרחב האישי.",
//       },
//       {
//         description:
//           "יישום נוסף הוא שימוש בשכבת מידע גיאוגרפי – התושבים יכולים לראות תהליכי שיתוף ציבור שעשיינו אותם מבחינת הקרבה הגיאוגרפית. הרשות המקומית בעלת גמישות מוחלטת בשימוש במערכת: צורך ואופן הליך שיתוף הציבור, סוג השאלות, הבחירה בין תצוגות, מיקום גיאוגרפי ועוד.",
//       },
//       {
//         description:
//           'תהליך שיתוף הציבור הראשון שקידמה המועצה המקומית גני תקווה עסק בסוגיה האסטרטגית של מעבר מטשטוש של מועצה מאות תושבים לתהליך פניות תושבים בהיקף נרחב – תהליך שיתוף הציבור השני עסק בהקמת אזור המאפשר התעסוקה מגוונת תוך התמקדות בתעסוקה הממוקדת ביותר, על-מנת לספק פתרון ביניים בין עבודה מרחוק לעבודה פיזית למרחקים של עשרות ק"מ.',
//       },
//     ],
//     suitable: "כולן.",
//     recommendations:
//       'המערכת ידידותית למשתמש וניתן להפעילה גם ע"י איש צוות אחראי יחיד. ניתן ואף מומלץ להגדיר בחלקן מן התהליכים שתהיה אחראי על תפקיד ויעלו רק באישור. כן, מומלץ להגדיר בעל תפקיד שיהיה אחראי על הסוגיה הנבחנת, למשל: אגף הדוברות, קשרי קהילה וכו. בנוסף, מומלץ לקיים תהליך הקמה משמעותי עם החברה בשלב אפיון הצרכים והמערכת. החברה מספקת את הייעוץ הנדרש וכדאי להעמיק בשלב זה. מומלץ לבחון האם בעיסוק בשאלות וסוגיות אסטרטגיות ורגישות, כדאי להסתייע בייעוץ חיצוני ובאגף הדוברות של הרשות המקומית.',
//     contacts: {
//       title: "רשות מקומית",
//       name: "נהומי חי",
//       role: "מנהל אגף קשרי קהילה, דוברות והסברה",
//       email: "nahumi@gantik.org.il",
//     },
//     providerBlock: {
//       title: "topsolutions",
//       iconSrc: "/images/webp/projects/provider/topsolutions.png",
//       articles: [
//         {
//           title: "שימושים ברשויות מקומיות",
//           description:
//             " תל אביב-יפו, מועצה מקומית גני תקווה, ארגון הג'וינט למגזר החרדי בשיתוף עם רשויות מקומיות בנגב, ועוד",
//         },
//         {
//           title: "לקוחות נוספים",
//           description: "עמותת דרכנו, עמותת שיתופים ועוד",
//         },
//         { title: "איש קשר", description: ' ערן עיציון, מנכ"ל | 050-6205284' },
//         { title: " שנת הקמה", description: "2021" },
//       ],
//       emails: [{ title: "eran@raizit.com" }, { title: "www.raizit.com" }],
//     },
//     contactBlock: {
//       title: "מעוניין לבצע את הפרויקט הזה באזורך?",
//     },
//     slider: [
//       { imageSrc: "/images/webp/projects/slider/ecocall-1.png" },
//       { imageSrc: "/images/webp/projects/slider/ecocall-1.png" },
//     ],
//   },
// }
// export interface AdditionalProject {
//   title: string
//   button: string
//   isAdditional?: boolean
// }
// export const ADDITIONAL_PROJECTS: AdditionalProject[] = [
//   {
//     title: "פרויקטים התואמים לפרופיל שלך",
//     button: "לכל הפרויקטים",
//   },
//   {
//     title: "פרויקטים נוספים שאולי תתעניין בהם",
//     button: "לכל הפרויקטים",
//     isAdditional: true,
//   },
// ]
// =========
import { Label } from "@/interfaces/projects"
import { ContactButton } from "@/interfaces/tools"

export const PROJECT_TAGS: Label[] = [
  { label: "פתרון גג:" },
  { label: "פתרון:" },
  { label: "ספק:" },
  { label: "רשות מקומית: " },
]

export const PROJECT_STATUS: Label[] = [
  { label: "סטטוס:" },
  { label: "משך הפרויקט:" },
  { label: "שנת פרויקט:" },
]

export const CONTACT_BUTTONS: ContactButton[] = [
  { title: "פתיחת פרויקט", variant: "primary" },
  {
    title: "עבור לרשימת הכלים ",
    variant: "gradient",
    isGradient: true,
  },
]

export interface AdditionalSection {
  title: string
  button: string
  isAdditional: boolean
}
export const ADDITIONAL_PROJECTS: AdditionalSection[] = [
  {
    title: "פרויקטים דומים לפי קטגוריה",
    button: "ראו עוד בקטגוריה זו",
    isAdditional: false,
  },
  {
    title: "פרויקטים נוספים לפי תחום",
    button: "גלה פרויקטים נוספים",
    isAdditional: true,
  },
]
