import { FormRowsData } from "@/interfaces/questionnaire"

export const FORM_ROWS: FormRowsData[] = [
  {
    title: "מיומנויות ",
    expanded: [
      {
        number: "01",
        description:
          "ברשות המקומית שלי יש פעילויות שמטרתן העלאות מודעות ולעודד עובדים ומנהלים לרכוש כלים לקידום חדשנות",
      },
      {
        number: "02",
        description:
          "הרשות מקומית שלי מציעה הכשרות ולימוד כלים (גישות שיטות חשיבה, פתרון בעיות, ניהול פרויקטים...) בתחום החדשנות כחלק מהשתלמויות ברשות ובמסגרת גופים נוספים",
      },
      {
        number: "03",
        description:
          "עובדים ומנהלים זוכים להערכה, באופן פורמאלי ובלתי פורמאלי על רכישת כלים שיישפרו ויקדמו חדשנות (משוב חיובי, איזכור בפגישות קבוצתיות, הענקת פרסים...)",
      },
      {
        number: "04",
        description:
          "ברשות שלי יש בעלי תפקידים מוגדרים שתפקידם לעודד ולטפח הדרכה והכשרה הקשורים לעידוד ולמימוש חדשנות בארגון",
      },
      {
        number: "05",
        description:
          "הרשות שלי מעודדת עובדים לרכוש מיומנויות שימוש והפעלה של טכנולוגיות מתקדמות ומכשירה אותם מקצועית כדי שיוכלו למצות את היכולות שלהן",
      },
    ],
    panel: {
      title: "מיומנויות",
      description:
        "הרשות מקומית מציידת הכשרות למנהליה ולעובדיה; הרשות מאפשרת הכרות עם כלים מובנים לניהול ולהטמעת חדשנות ומקדימה התנסות בהם. הרשות מאפשרת לעובדים ומנהלים לממש מיומנויות של קידום חדשנות בעשיה. היוזמות והפרויקטים מיועדים",
    },
  },
  {
    title: "משאבים",
    expanded: [
      {
        number: "01",
        description:
          "ברשות המקומית שלי יש פעילויות שמטרתן העלאות מודעות ולעודד עובדים ומנהלים לרכוש כלים לקידום חדשנות",
      },
      {
        number: "02",
        description:
          "הרשות מקומית שלי מציעה הכשרות ולימוד כלים (גישות שיטות חשיבה, פתרון בעיות, ניהול פרויקטים...) בתחום החדשנות כחלק מהשתלמויות ברשות ובמסגרת גופים נוספים",
      },
      {
        number: "03",
        description:
          "עובדים ומנהלים זוכים להערכה, באופן פורמאלי ובלתי פורמאלי על רכישת כלים שיישפרו ויקדמו חדשנות (משוב חיובי, איזכור בפגישות קבוצתיות, הענקת פרסים...)",
      },
      {
        number: "04",
        description:
          "ברשות שלי יש בעלי תפקידים מוגדרים שתפקידם לעודד ולטפח הדרכה והכשרה הקשורים לעידוד ולמימוש חדשנות בארגון",
      },
      {
        number: "05",
        description:
          "הרשות שלי מעודדת עובדים לרכוש מיומנויות שימוש והפעלה של טכנולוגיות מתקדמות ומכשירה אותם מקצועית כדי שיוכלו למצות את היכולות שלהן",
      },
    ],
    panel: {
      title: "מיומנויות",
      description:
        "הרשות מקומית מציידת הכשרות למנהליה ולעובדיה; הרשות מאפשרת הכרות עם כלים מובנים לניהול ולהטמעת חדשנות ומקדימה התנסות בהם. הרשות מאפשרת לעובדים ומנהלים לממש מיומנויות של קידום חדשנות בעשיה. היוזמות והפרויקטים מיועדים",
    },
  },
  {
    title: "התנהגויות",
    expanded: [
      {
        number: "01",
        description:
          "ברשות המקומית שלי יש פעילויות שמטרתן העלאות מודעות ולעודד עובדים ומנהלים לרכוש כלים לקידום חדשנות",
      },
      {
        number: "02",
        description:
          "הרשות מקומית שלי מציעה הכשרות ולימוד כלים (גישות שיטות חשיבה, פתרון בעיות, ניהול פרויקטים...) בתחום החדשנות כחלק מהשתלמויות ברשות ובמסגרת גופים נוספים",
      },
      {
        number: "03",
        description:
          "עובדים ומנהלים זוכים להערכה, באופן פורמאלי ובלתי פורמאלי על רכישת כלים שיישפרו ויקדמו חדשנות (משוב חיובי, איזכור בפגישות קבוצתיות, הענקת פרסים...)",
      },
      {
        number: "04",
        description:
          "ברשות שלי יש בעלי תפקידים מוגדרים שתפקידם לעודד ולטפח הדרכה והכשרה הקשורים לעידוד ולמימוש חדשנות בארגון",
      },
      {
        number: "05",
        description:
          "הרשות שלי מעודדת עובדים לרכוש מיומנויות שימוש והפעלה של טכנולוגיות מתקדמות ומכשירה אותם מקצועית כדי שיוכלו למצות את היכולות שלהן",
      },
    ],
    panel: {
      title: "מיומנויות",
      description:
        "הרשות מקומית מציידת הכשרות למנהליה ולעובדיה; הרשות מאפשרת הכרות עם כלים מובנים לניהול ולהטמעת חדשנות ומקדימה התנסות בהם. הרשות מאפשרת לעובדים ומנהלים לממש מיומנויות של קידום חדשנות בעשיה. היוזמות והפרויקטים מיועדים",
    },
  },
  {
    title: "תקשורת",
    expanded: [
      {
        number: "01",
        description:
          "ברשות המקומית שלי יש פעילויות שמטרתן העלאות מודעות ולעודד עובדים ומנהלים לרכוש כלים לקידום חדשנות",
      },
      {
        number: "02",
        description:
          "הרשות מקומית שלי מציעה הכשרות ולימוד כלים (גישות שיטות חשיבה, פתרון בעיות, ניהול פרויקטים...) בתחום החדשנות כחלק מהשתלמויות ברשות ובמסגרת גופים נוספים",
      },
      {
        number: "03",
        description:
          "עובדים ומנהלים זוכים להערכה, באופן פורמאלי ובלתי פורמאלי על רכישת כלים שיישפרו ויקדמו חדשנות (משוב חיובי, איזכור בפגישות קבוצתיות, הענקת פרסים...)",
      },
      {
        number: "04",
        description:
          "ברשות שלי יש בעלי תפקידים מוגדרים שתפקידם לעודד ולטפח הדרכה והכשרה הקשורים לעידוד ולמימוש חדשנות בארגון",
      },
      {
        number: "05",
        description:
          "הרשות שלי מעודדת עובדים לרכוש מיומנויות שימוש והפעלה של טכנולוגיות מתקדמות ומכשירה אותם מקצועית כדי שיוכלו למצות את היכולות שלהן",
      },
    ],
    panel: {
      title: "מיומנויות",
      description:
        "הרשות מקומית מציידת הכשרות למנהליה ולעובדיה; הרשות מאפשרת הכרות עם כלים מובנים לניהול ולהטמעת חדשנות ומקדימה התנסות בהם. הרשות מאפשרת לעובדים ומנהלים לממש מיומנויות של קידום חדשנות בעשיה. היוזמות והפרויקטים מיועדים",
    },
  },
  {
    title: "תוצאות",
    expanded: [
      {
        number: "01",
        description:
          "ברשות המקומית שלי יש פעילויות שמטרתן העלאות מודעות ולעודד עובדים ומנהלים לרכוש כלים לקידום חדשנות",
      },
      {
        number: "02",
        description:
          "הרשות מקומית שלי מציעה הכשרות ולימוד כלים (גישות שיטות חשיבה, פתרון בעיות, ניהול פרויקטים...) בתחום החדשנות כחלק מהשתלמויות ברשות ובמסגרת גופים נוספים",
      },
      {
        number: "03",
        description:
          "עובדים ומנהלים זוכים להערכה, באופן פורמאלי ובלתי פורמאלי על רכישת כלים שיישפרו ויקדמו חדשנות (משוב חיובי, איזכור בפגישות קבוצתיות, הענקת פרסים...)",
      },
      {
        number: "04",
        description:
          "ברשות שלי יש בעלי תפקידים מוגדרים שתפקידם לעודד ולטפח הדרכה והכשרה הקשורים לעידוד ולמימוש חדשנות בארגון",
      },
      {
        number: "05",
        description:
          "הרשות שלי מעודדת עובדים לרכוש מיומנויות שימוש והפעלה של טכנולוגיות מתקדמות ומכשירה אותם מקצועית כדי שיוכלו למצות את היכולות שלהן",
      },
    ],
    panel: {
      title: "מיומנויות",
      description:
        "הרשות מקומית מציידת הכשרות למנהליה ולעובדיה; הרשות מאפשרת הכרות עם כלים מובנים לניהול ולהטמעת חדשנות ומקדימה התנסות בהם. הרשות מאפשרת לעובדים ומנהלים לממש מיומנויות של קידום חדשנות בעשיה. היוזמות והפרויקטים מיועדים",
    },
  },
  {
    title: "משימות",
    expanded: [
      {
        number: "01",
        description:
          "ברשות המקומית שלי יש פעילויות שמטרתן העלאות מודעות ולעודד עובדים ומנהלים לרכוש כלים לקידום חדשנות",
      },
      {
        number: "02",
        description:
          "הרשות מקומית שלי מציעה הכשרות ולימוד כלים (גישות שיטות חשיבה, פתרון בעיות, ניהול פרויקטים...) בתחום החדשנות כחלק מהשתלמויות ברשות ובמסגרת גופים נוספים",
      },
      {
        number: "03",
        description:
          "עובדים ומנהלים זוכים להערכה, באופן פורמאלי ובלתי פורמאלי על רכישת כלים שיישפרו ויקדמו חדשנות (משוב חיובי, איזכור בפגישות קבוצתיות, הענקת פרסים...)",
      },
      {
        number: "04",
        description:
          "ברשות שלי יש בעלי תפקידים מוגדרים שתפקידם לעודד ולטפח הדרכה והכשרה הקשורים לעידוד ולמימוש חדשנות בארגון",
      },
      {
        number: "05",
        description:
          "הרשות שלי מעודדת עובדים לרכוש מיומנויות שימוש והפעלה של טכנולוגיות מתקדמות ומכשירה אותם מקצועית כדי שיוכלו למצות את היכולות שלהן",
      },
    ],
    panel: {
      title: "מיומנויות",
      description:
        "הרשות מקומית מציידת הכשרות למנהליה ולעובדיה; הרשות מאפשרת הכרות עם כלים מובנים לניהול ולהטמעת חדשנות ומקדימה התנסות בהם. הרשות מאפשרת לעובדים ומנהלים לממש מיומנויות של קידום חדשנות בעשיה. היוזמות והפרויקטים מיועדים",
    },
  },
  {
    title: "תהליכים",
    expanded: [
      {
        number: "01",
        description:
          "ברשות המקומית שלי יש פעילויות שמטרתן העלאות מודעות ולעודד עובדים ומנהלים לרכוש כלים לקידום חדשנות",
      },
      {
        number: "02",
        description:
          "הרשות מקומית שלי מציעה הכשרות ולימוד כלים (גישות שיטות חשיבה, פתרון בעיות, ניהול פרויקטים...) בתחום החדשנות כחלק מהשתלמויות ברשות ובמסגרת גופים נוספים",
      },
      {
        number: "03",
        description:
          "עובדים ומנהלים זוכים להערכה, באופן פורמאלי ובלתי פורמאלי על רכישת כלים שיישפרו ויקדמו חדשנות (משוב חיובי, איזכור בפגישות קבוצתיות, הענקת פרסים...)",
      },
      {
        number: "04",
        description:
          "ברשות שלי יש בעלי תפקידים מוגדרים שתפקידם לעודד ולטפח הדרכה והכשרה הקשורים לעידוד ולמימוש חדשנות בארגון",
      },
      {
        number: "05",
        description:
          "הרשות שלי מעודדת עובדים לרכוש מיומנויות שימוש והפעלה של טכנולוגיות מתקדמות ומכשירה אותם מקצועית כדי שיוכלו למצות את היכולות שלהן",
      },
    ],
    panel: {
      title: "מיומנויות",
      description:
        "הרשות מקומית מציידת הכשרות למנהליה ולעובדיה; הרשות מאפשרת הכרות עם כלים מובנים לניהול ולהטמעת חדשנות ומקדימה התנסות בהם. הרשות מאפשרת לעובדים ומנהלים לממש מיומנויות של קידום חדשנות בעשיה. היוזמות והפרויקטים מיועדים",
    },
  },
]
