import {
  ContactButton,
  MainArticleTitle,
  SolutionLabel,
  ToolsDetails,
} from "@/interfaces/tools"
export const SOLUTION_LABELS: SolutionLabel[] = [
  { title: " פתרון גרעיני:" },
  { title: "פתרון:" },
]
export const PARAGRAPH_TITLES: MainArticleTitle[] = [
  { title: " תיאור הפעילות:" },
  { title: "מתי מתאים:" },
  { title: "מה נדרש מהרשות המקומית:" },
  { title: "מה נדרש כדי לנצח:" },
  { title: "שתפים:" },
]
export const CONTACT_BUTTONS: ContactButton[] = [
  { title: "פתיחת פרויקט", variant: "primary", redirectTo: "/" },
  {
    title: "עבור לרשימת הכלים ",
    variant: "gradient",
    redirectTo: "/",
    isGradient: true,
  },
]
export const TOOLS_DATA: Record<string, ToolsDetails> = {
  hackathon: {
    id: "האקתון",
    name: "Hackathon",
    headerTitle: "האקתון",
    solutions: [{ title: "האקתון" }, { title: "האקתון רשתי" }],
    mainArticles: [
      {
        description:
          ' אירועי "פיתוח פתרונות", המשתתפים ב"חכמת ההמונים", עבור התמודדות עם אתגר אמיתי מראש הרשות על-ידי הרשות המקומית. האירוע הוא בהשתתפות מגוון רחב של עובדים, בעלי עניין ואנשי מקצוע, העובדים בקבוצות חשיבה, יוצרים ומפתחים יחדיו רעיונות ופתרונות פורצי דרך. משך האירוע נע בין 5-48 שעות במתכונת של התנסות אינטנסיבית בפעילות פתוחה. פעמים רבות אירועים מסוג זה נמשכים אל תוך הלילה, ומגיעים לשיאם במשתתפים יוצרים תגובות אינטואיטיביות מאד.',
      },
      {
        description:
          "מומלץ במיוחד לאתגרים מהותיים לרשות, הנוגעים סוגיות סיבוך ובעלי השלכות רוחביות. מתאים כאשר קיים ידע רלוונטי רב גם מחוץ לשורות המקצועיות והארגוניות של גורמים עסקיים/אקדמיים/טכנולוגיים ואחרים.",
      },
      {
        description:
          "הפעילות מועילה ברתימת אוכלוסיות ספציפיות של תושבים ובעלי עניין, סביב אתגר הרלוונטי להם. הפעילות תעזור ותגביר את מעורבותם ומחויבותם לפתרונות ולהחלטות שיתקבלו. האירוע במהותו מייצר עניין ומשקף רצון ברשות המקומית ומחוץ לה להקדים פתרונות. נקודת אווירה חיובית שיווצר בפעולה בתוך הרשות המקומית, תהווה הקשר של הרשות עם גורמים חיצוניים, מתהווה הזדמנות לתקשר ולמתג את הרשות המקומית ככזו המחדשת ומקצינה יוזמות חדשנות לפתור אתגרים ומובילה חדשנות, שהגורמים המשתתפים בהן בוטחים בה באופן עמוק.",
      },
      {
        description:
          "התנעה, הובלה וביצוע האירוע ניתנים להובלה באופן עצמאי על-ידי הרשות המקומית, אך מומלץ לעבוד עם גורמים מקצועיים, שיודעים להפיק אירועים משמעותיים ואיכותיים. היות ומדובר על סוג של מרתון חשיבה, נדרשת הנחיה מקצועית וליווי של מנטורים, לשם הפקת המירב והמיטב מן המאמץ המרוכז.",
      },
      {
        description:
          "ניתן לביצוע עצמאי על בסיס ניסיון קיים ברשות המקומית. מומלץ להליך צוות היגוי בתכנון, בהפקה ובהנחיה ולהיעזר בגורמים מקצועיים.",
      },
    ],
    providerBlock: {
      title: "ספק",
      provider: "SIT Innovation",
      label: "Systematic Inventive Thinking",
      iconSrc: "/images/svg/sit-icon.png",
      description:
        "אנו עוזרים לארגונים להצליח על-ידי מימוש חדשנות בת קיימא, בטווח המיידי ובטווח הארוך. על-מנת להשיג זאת, אנו משתמשים בשיטה פורצת דרך - SIT - Systematic Inventive Thinking כדי לעודד חשיבה חדשנית ויצירתית וכדי לנהל את היישום הארגוני עבור הלקוחות שלנו.",
      adress: "תעודת הוקרה 16, תל אביב 67891",
      phone: "03-5456000",
      email: "info@sitsite.com",
    },
    contactBlock: {
      title: "מעוניין לבצע את הפרויקט הזה באזורך?",
    },
    slider: [
      { imageSrc: "/images/webp/tools/slider/hackathon/slide-1.png" },
      { imageSrc: "/images/webp/tools/slider/hackathon/slide-1.png" },
    ],
  },
}
