interface ButtonsProps {
  title: string
}

export interface CardsProps {
  title: string
  imageSrc: string
}
export const FILTER_BUTTONS: ButtonsProps[] = [
  { title: "הכל" },
  { title: "מיומנות" },
  { title: "משאבים" },
  { title: "התנהגויות" },
  { title: "תקשורת" },
  { title: "תוצאות" },
  { title: "משילות" },
  { title: "תהליכים" },
]

// export const CARDS: CardsProps[] = [
//   {
//     title: "האקתון",
//     sectionKey: "מיומנויות",
//     minScore: 20,
//     filterMatch: ["מיומנות"],
//     buttons: [
//       { title: "שיתוף פעולה" },
//       { title: "יצירתיות" },
//       { title: "הטמעת " },
//       { title: "משאבים" },
//     ],
//     imageSrc: "/images/webp/tools/tool-1.png",
//     modal: {
//       title: "האקתון",
//       description:
//         'אירוע יומיים מרתק, בו משלבים כוחות בעלי תפקידים מהרשות המקומית עם מומחים חיצוניים. מטרת ההאקתון היא שימוש ב"חכמת ההמונים" עבור המצאה משותפת של פתרונות, בעבודה מרוכזת ובזמן קצר. האירוע משלב עבודה בקבוצות חשיבה ופיתוח של רעיונות והמצאות פורצות דרך, אל מול אתגר מוגדר של הרשות המקומית.',
//       redirectTo: "/tool/hackathon",
//     },
//   },
//   {
//     title: "ועדת היגוי חדשנות",
//     sectionKey: "משאבים",
//     minScore: 15,
//     filterMatch: ["משאבים"],
//     buttons: [
//       { title: "תיעדוף " },
//       { title: "הטמעת " },
//       { title: "משאבים" },
//       { title: "תקשורת" },
//     ],
//     imageSrc: "/images/webp/tools/tool-2.png",
//     modal: {
//       title: "עדת היגוי חדשנות",
//       description:
//         'אירוע יומיים מרתק, בו משלבים כוחות בעלי תפקידים מהרשות המקומית עם מומחים חיצוניים. מטרת ההאקתון היא שימוש ב"חכמת ההמונים" עבור המצאה משותפת של פתרונות, בעבודה מרוכזת ובזמן קצר. האירוע משלב עבודה בקבוצות חשיבה ופיתוח של רעיונות והמצאות פורצות דרך, אל מול אתגר מוגדר של הרשות המקומית.',
//       redirectTo: "/tool/process_management",
//     },
//   },
//   {
//     title: "מפגשי בזק - ספרינט פלאן",
//     sectionKey: "התנהגויות",
//     minScore: 12,
//     filterMatch: ["התנהגויות"],

//     buttons: [
//       { title: "התנהגויות" },
//       { title: "תקשורת" },
//       { title: "משאבים" },
//       { title: "תוצאות" },
//     ],
//     imageSrc: "/images/webp/tools/tool-3.png",
//     modal: {
//       title: "מפגשי בזק - ספרינט פלאן",
//       description:
//         'אירוע יומיים מרתק, בו משלבים כוחות בעלי תפקידים מהרשות המקומית עם מומחים חיצוניים. מטרת ההאקתון היא שימוש ב"חכמת ההמונים" עבור המצאה משותפת של פתרונות, בעבודה מרוכזת ובזמן קצר. האירוע משלב עבודה בקבוצות חשיבה ופיתוח של רעיונות והמצאות פורצות דרך, אל מול אתגר מוגדר של הרשות המקומית.',
//       redirectTo: "/tool/sprint_plan",
//     },
//   },
//   {
//     title: "מקדמי חדשנות ברשות",
//     sectionKey: "תקשורת",
//     minScore: 10,
//     filterMatch: ["תקשורת"],

//     buttons: [
//       { title: "שיתוף " },
//       { title: "הטמעת " },
//       { title: "משאבים" },
//       { title: "תקשורת" },
//     ],
//     imageSrc: "/images/webp/tools/tool-4.png",
//     modal: {
//       title: "מקדמי חדשנות",
//       description:
//         'אירוע יומיים מרתק, בו משלבים כוחות בעלי תפקידים מהרשות המקומית עם מומחים חיצוניים. מטרת ההאקתון היא שימוש ב"חכמת ההמונים" עבור המצאה משותפת של פתרונות, בעבודה מרוכזת ובזמן קצר. האירוע משלב עבודה בקבוצות חשיבה ופיתוח של רעיונות והמצאות פורצות דרך, אל מול אתגר מוגדר של הרשות המקומית.',
//       redirectTo: "/tool/innovation_promoters",
//     },
//   },
//   {
//     title: "עידוד יזמות עובדים",
//     sectionKey: "תוצאות",
//     minScore: 9,
//     filterMatch: ["תוצאות"],
//     buttons: [
//       { title: "הטמעת " },
//       { title: "שיתוף " },
//       { title: "משאבים" },
//       { title: "תקשורת" },
//     ],
//     imageSrc: "/images/webp/tools/tool-5.png",
//     modal: {
//       title: "עידוד יזמות עובדים",
//       description:
//         'אירוע יומיים מרתק, בו משלבים כוחות בעלי תפקידים מהרשות המקומית עם מומחים חיצוניים. מטרת ההאקתון היא שימוש ב"חכמת ההמונים" עבור המצאה משותפת של פתרונות, בעבודה מרוכזת ובזמן קצר. האירוע משלב עבודה בקבוצות חשיבה ופיתוח של רעיונות והמצאות פורצות דרך, אל מול אתגר מוגדר של הרשות המקומית.',
//       redirectTo: "/tool/employee_innovation",
//     },
//   },
//   {
//     title: "קבוצת מיקוד יוצרת ECHO",
//     sectionKey: "משימות",
//     minScore: 6,
//     filterMatch: ["משילות"],

//     buttons: [
//       { title: "הטמעת " },
//       { title: "שיתוף " },
//       { title: "משאבים" },
//       { title: "תקשורת" },
//     ],
//     imageSrc: "/images/webp/tools/tool-6.png",
//     modal: {
//       title: "קבוצת מיקוד יוצרת - Echo",
//       description:
//         'אירוע יומיים מרתק, בו משלבים כוחות בעלי תפקידים מהרשות המקומית עם מומחים חיצוניים. מטרת ההאקתון היא שימוש ב"חכמת ההמונים" עבור המצאה משותפת של פתרונות, בעבודה מרוכזת ובזמן קצר. האירוע משלב עבודה בקבוצות חשיבה ופיתוח של רעיונות והמצאות פורצות דרך, אל מול אתגר מוגדר של הרשות המקומית.',
//       redirectTo: "/tool/echo_focus_group",
//     },
//   },
//   {
//     title: "ניהול תהליכים ברשות",
//     sectionKey: "תהליכים",
//     minScore: 4,
//     filterMatch: ["תהליכים"],

//     buttons: [
//       { title: "הטמעת " },
//       { title: "שיתוף " },
//       { title: "משאבים" },
//       { title: "תקשורת" },
//     ],
//     imageSrc: "/images/webp/tools/tool-6.png",
//     modal: {
//       title: "קבוצת מיקוד יוצרת - Echo",
//       description:
//         'אירוע יומיים מרתק, בו משלבים כוחות בעלי תפקידים מהרשות המקומית עם מומחים חיצוניים. מטרת ההאקתון היא שימוש ב"חכמת ההמונים" עבור המצאה משותפת של פתרונות, בעבודה מרוכזת ובזמן קצר. האירוע משלב עבודה בקבוצות חשיבה ופיתוח של רעיונות והמצאות פורצות דרך, אל מול אתגר מוגדר של הרשות המקומית.',
//       redirectTo: "/tool/echo_focus_group",
//     },
//   },
// ]
