interface ButtonsProps {
  title: string
}
interface ModalProps {
  title: string
  description: string
  redirectTo: string
}
export interface CardsProps {
  title: string
  buttons: ButtonsProps[]
  imageSrc: string
  modal: ModalProps
}
export const FILTER_BUTTONS: ButtonsProps[] = [
  { title: "הכל" },
  { title: "סינרגיה" },
  { title: "משאבים" },
  { title: "התייעלות" },
  { title: "חדשנות" },
  { title: "רגולציה" },
  { title: "שירותים" },
  { title: "תהליכים" },
]

export const CARDS: CardsProps[] = [
  {
    title: "האקתון",
    buttons: [
      { title: "שיתוף פעולה" },
      { title: "יצירתיות" },
      { title: "הטמעת " },
      { title: "משאבים" },
    ],
    imageSrc: "/images/webp/tools/tool-1.png",
    modal: {
      title: "האקתון",
      description:
        'אירוע יומיים מרתק, בו משלבים כוחות בעלי תפקידים מהרשות המקומית עם מומחים חיצוניים. מטרת ההאקתון היא שימוש ב"חכמת ההמונים" עבור המצאה משותפת של פתרונות, בעבודה מרוכזת ובזמן קצר. האירוע משלב עבודה בקבוצות חשיבה ופיתוח של רעיונות והמצאות פורצות דרך, אל מול אתגר מוגדר של הרשות המקומית.',
      redirectTo: "/tool/hackathon",
    },
  },
  {
    title: "עדת היגוי חדשנות",
    buttons: [
      { title: "תיעדוף " },
      { title: "הטמעת " },
      { title: "משאבים" },
      { title: "תקשורת" },
    ],
    imageSrc: "/images/webp/tools/tool-2.png",
    modal: {
      title: "עדת היגוי חדשנות",
      description:
        'אירוע יומיים מרתק, בו משלבים כוחות בעלי תפקידים מהרשות המקומית עם מומחים חיצוניים. מטרת ההאקתון היא שימוש ב"חכמת ההמונים" עבור המצאה משותפת של פתרונות, בעבודה מרוכזת ובזמן קצר. האירוע משלב עבודה בקבוצות חשיבה ופיתוח של רעיונות והמצאות פורצות דרך, אל מול אתגר מוגדר של הרשות המקומית.',
      redirectTo: "/",
    },
  },
  {
    title: "מפגשי בזק - Sprint",
    buttons: [
      { title: "התנהגויות" },
      { title: "תקשורת" },
      { title: "משאבים" },
      { title: "תוצאות" },
    ],
    imageSrc: "/images/webp/tools/tool-3.png",
    modal: {
      title: "מפגשי בזק - Sprint",
      description:
        'אירוע יומיים מרתק, בו משלבים כוחות בעלי תפקידים מהרשות המקומית עם מומחים חיצוניים. מטרת ההאקתון היא שימוש ב"חכמת ההמונים" עבור המצאה משותפת של פתרונות, בעבודה מרוכזת ובזמן קצר. האירוע משלב עבודה בקבוצות חשיבה ופיתוח של רעיונות והמצאות פורצות דרך, אל מול אתגר מוגדר של הרשות המקומית.',
      redirectTo: "/",
    },
  },
  {
    title: "מקדמי חדשנות",
    buttons: [
      { title: "שיתוף " },
      { title: "הטמעת " },
      { title: "משאבים" },
      { title: "תקשורת" },
    ],
    imageSrc: "/images/webp/tools/tool-4.png",
    modal: {
      title: "מקדמי חדשנות",
      description:
        'אירוע יומיים מרתק, בו משלבים כוחות בעלי תפקידים מהרשות המקומית עם מומחים חיצוניים. מטרת ההאקתון היא שימוש ב"חכמת ההמונים" עבור המצאה משותפת של פתרונות, בעבודה מרוכזת ובזמן קצר. האירוע משלב עבודה בקבוצות חשיבה ופיתוח של רעיונות והמצאות פורצות דרך, אל מול אתגר מוגדר של הרשות המקומית.',
      redirectTo: "/",
    },
  },
  {
    title: "עידוד יזמות עובדים",
    buttons: [
      { title: "הטמעת " },
      { title: "שיתוף " },
      { title: "משאבים" },
      { title: "תקשורת" },
    ],
    imageSrc: "/images/webp/tools/tool-5.png",
    modal: {
      title: "עידוד יזמות עובדים",
      description:
        'אירוע יומיים מרתק, בו משלבים כוחות בעלי תפקידים מהרשות המקומית עם מומחים חיצוניים. מטרת ההאקתון היא שימוש ב"חכמת ההמונים" עבור המצאה משותפת של פתרונות, בעבודה מרוכזת ובזמן קצר. האירוע משלב עבודה בקבוצות חשיבה ופיתוח של רעיונות והמצאות פורצות דרך, אל מול אתגר מוגדר של הרשות המקומית.',
      redirectTo: "/",
    },
  },
  {
    title: "קבוצת מיקוד יוצרת - Echo",
    buttons: [
      { title: "הטמעת " },
      { title: "שיתוף " },
      { title: "משאבים" },
      { title: "תקשורת" },
    ],
    imageSrc: "/images/webp/tools/tool-6.png",
    modal: {
      title: "קבוצת מיקוד יוצרת - Echo",
      description:
        'אירוע יומיים מרתק, בו משלבים כוחות בעלי תפקידים מהרשות המקומית עם מומחים חיצוניים. מטרת ההאקתון היא שימוש ב"חכמת ההמונים" עבור המצאה משותפת של פתרונות, בעבודה מרוכזת ובזמן קצר. האירוע משלב עבודה בקבוצות חשיבה ופיתוח של רעיונות והמצאות פורצות דרך, אל מול אתגר מוגדר של הרשות המקומית.',
      redirectTo: "/",
    },
  },
]
